-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2024-05-26 10:38:29
-- 伺服器版本： 10.4.32-MariaDB
-- PHP 版本： 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `machi_db`
--

-- --------------------------------------------------------

--
-- 資料表結構 `category`
--

CREATE TABLE `category` (
  `category_id` int(6) UNSIGNED NOT NULL,
  `category_name` varchar(30) NOT NULL,
  `category_status` tinyint(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `category`
--

INSERT INTO `category` (`category_id`, `category_name`, `category_status`) VALUES
(1, '麵包', 1),
(2, '蛋糕', 1),
(3, '餅乾 / 酥餅', 1),
(4, '塔派', 1),
(5, '奶烙 / 布丁', 1),
(6, '其他', 1),
(7, '課程類別', 1);

-- --------------------------------------------------------

--
-- 資料表結構 `class`
--

CREATE TABLE `class` (
  `class_id` int(6) UNSIGNED NOT NULL,
  `subcategory_id_fk` int(6) NOT NULL,
  `teacher_id_fk` int(6) NOT NULL,
  `class_level` text NOT NULL,
  `class_locations` varchar(50) NOT NULL,
  `class_img` varchar(50) NOT NULL,
  `class_name` varchar(50) NOT NULL,
  `class_intro` text NOT NULL,
  `class_price` int(6) NOT NULL,
  `class_enroll_start` datetime NOT NULL,
  `class_enroll_end` datetime NOT NULL,
  `class_coursedate_start` datetime NOT NULL,
  `class_coursedate_end` datetime NOT NULL,
  `class_status` tinyint(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `class`
--

INSERT INTO `class` (`class_id`, `subcategory_id_fk`, `teacher_id_fk`, `class_level`, `class_locations`, `class_img`, `class_name`, `class_intro`, `class_price`, `class_enroll_start`, `class_enroll_end`, `class_coursedate_start`, `class_coursedate_end`, `class_status`) VALUES
(1, 31, 1, '初階', '台北', '1-1.png', '私房洋果子甜點課 | 零基礎輕鬆上手 18 道甜點', '呂昇達老師帶你製作 18 道甜點，用基礎設備、容易取得的原料，就可以在餐桌上端出職人級的享受。', 1600, '2024-01-01 00:00:00', '2024-12-31 23:59:00', '2024-01-15 12:00:00', '2024-01-15 15:00:00', 1),
(2, 31, 2, '高階', '台中', '2-1.png', '呂昇達老師的烘焙餡料研究室｜15款甜點與22+種餡料變化', '實體課場場爆滿，人氣甜點名師呂昇達老師的第二堂甜點課來了！ 這次將運用 15 款甜點與超過 22 種的餡料，教你搭出無限變化，賦予甜點嶄新的生命力！ 課程內容包括了各種口感輕盈或奶味濃厚的奶油霜、奶油香緹、加入東方美人茶香氣的卡士達醬、融入四季水果風味的焦糖醬等餡料製作方法。還會教大家製作 #泡芙、 #馬卡龍、 #千層派 等甜點的原型變化，最後加碼中式甜點製作，滿足你對甜點的所有想像！', 3650, '2024-01-01 00:00:00', '2024-12-31 23:59:00', '2024-01-26 10:00:00', '2024-01-26 14:00:00', 1),
(3, 31, 3, '中階', '台北', '3-1.png', '抹茶控的第一堂課 | 十款職人級抹茶甜點輕鬆上桌', '首堂?全抹茶?的烘焙課程！從認識真正的抹茶開始，一路走進廚房，告訴你抹茶粉運用在甜點上的諸多秘密。 並仔細帶你完成十道「營業用配方」的抹茶甜點，讓你在家天天都是抹茶季??', 2680, '2024-01-01 00:00:00', '2024-12-31 23:59:00', '2024-02-08 15:00:00', '2024-02-08 15:00:00', 1),
(4, 32, 4, '初階', '桃園', '4-1.png', '低熱量馬卡龍自己做：韓國金老師的甜點時光', '低熱量馬卡龍製作課程，教你製作好看又好吃的法式、義式、瑞士法卡龍。從工具材料準備開始，教你製作馬卡龍的本體與不同口味的內陷，在家也能做出送禮自用兩相宜的低熱量馬卡龍。', 1280, '2024-01-01 00:00:00', '2024-12-31 23:59:00', '2024-02-14 09:00:00', '2024-02-14 12:00:00', 1),
(5, 33, 5, '高階', '台中', '5-1.png', '幸子的法式甜點研製所｜16 款達克瓦茲與常溫甜點 × 商用禮盒攻略', '這堂課將帶給你多種常溫甜點的製作攻略！集結幸子老師實體課程熱門主題與開單販售秒殺品項，包含達克瓦茲、磅蛋糕、小泡芙、瑪德蓮、費南雪，課程結束後，你將可以組裝出一個完整的甜點禮盒。無論你是喜歡享受甜點製作的快樂，還是想了解工作室經營心法，這堂課都能滿足你的需求！', 3500, '2024-01-01 00:00:00', '2024-12-31 23:59:00', '2024-02-26 13:00:00', '2024-02-26 16:00:00', 1),
(6, 32, 6, '中階', '台中', '6-1.png', '馬卡龍風味研究室｜外殼秘密X15+5種內餡一次掌握', '挑戰法式甜點之最--馬卡龍，製作外酥內軟、口感不甜膩的馬卡龍 教你學習蛋白霜打法、拆解烘焙原理、不同風味創作的甜點秘密', 2200, '2024-01-01 00:00:00', '2024-12-31 23:59:00', '2024-03-14 15:00:00', '2024-03-14 17:00:00', 1),
(7, 31, 7, '高階', '桃園', '7-1.png', '世界冠軍甜點學｜法式經典配方 X 異國創意風味', '來自法國的經典配方 X 汲取異國的創意風味，跟著 Bouillet 兄弟，一次學會最道地的法式甜點，與來自世界各地的創意風味！', 3800, '2024-01-01 00:00:00', '2024-12-31 23:59:00', '2024-03-22 11:00:00', '2024-03-22 15:00:00', 1),
(8, 31, 8, '中階', '台北', '8-1.png', '主廚的修煉｜12+4 道經典法式甜點即刻上桌', '黃偈老師第一季經典課程，以法式甜點概論為主軸，了解基本元素與概念，無論是經典或創新，各種變化皆難不倒你！', 2680, '2024-01-01 00:00:00', '2024-12-31 23:59:00', '2024-03-30 12:00:00', '2024-03-30 15:00:00', 1),
(9, 36, 9, '中階', '桃園', '9-1.png', '黃威達｜學會烘焙名店15款日式經典乳酪甜點', '乳酪職人的課程！總共教你超過 15 款乳酪甜點！以基礎知識結合實作示範，包含經典的乳酪蛋糕、健康的無麩蛋糕、超人氣的乳酪伴手禮，健康天然的食材，小朋友吃也好安心！最後也會教你基本的甜點行銷觀念！', 2550, '2024-01-01 00:00:00', '2024-12-31 23:59:00', '2024-04-16 10:00:00', '2024-04-16 14:00:00', 1),
(10, 31, 10, '高階', '台中', '10-1.png', '主廚的 27 道私藏甜點秘笈 | 經典 x 台味一次上手', '共 10 位甜點主廚，教導 27 道私藏甜點 + 3 種以上水果果醬。並且用台灣食材來進行口味變化，創造經典 mix 台味的甜點，突破原始的法式、日式甜點框架。附贈 #詳細食譜配方，讓初學者也能做出自己的甜點！', 3320, '2024-01-01 00:00:00', '2024-12-31 23:59:00', '2024-04-28 13:00:00', '2024-04-28 16:00:00', 1),
(11, 34, 11, '初階', '台北', '11-1.png', '【做胖死我太太肉桂捲】一起胖！用甜點說甜話', '其實要做出一個好吃的肉桂捲，真的不難！ 重點就在於掌握幾個關鍵秘訣，就可以克服這一切的問題！', 1350, '2024-01-01 00:00:00', '2024-12-31 23:59:00', '2024-05-05 10:00:00', '2024-05-05 12:00:00', 1),
(12, 35, 12, '中階', '桃園', '12-1.png', '甜點藝術家 Jeffrey｜當巧克力遇上七款經典甜點之作', '獻給巧克力控的經典課程，由巧克力職人Jeffrey王家承帶你掌握巧克力特性，學會巧克力甜點的風味平衡，創造7款經典甜點之作！', 2880, '2024-01-01 00:00:00', '2024-12-31 23:59:00', '2024-05-20 10:00:00', '2024-05-20 13:00:00', 1),
(13, 34, 13, '高階', '台中', '13-1.png', '武子靖與大師們的居家烘焙課 - 來自四季的15道麵包與甜點', '首堂集結世界級主廚的課程，教你做出五星級甜點、麵包，跟著大師手法、創作思維，讓你一次上手！', 3500, '2024-01-01 00:00:00', '2024-12-31 23:59:00', '2024-06-02 15:00:00', '2024-06-02 19:00:00', 1),
(14, 31, 14, '中階', '台北', '14-1.png', '法式甜點指南｜從烘焙理論到創意發想', '層次豐富、風味多變是法式甜點的精神，當你能隨心駕馭食材及製作手法，你專屬的創意甜點即將誕生！', 2500, '2024-01-01 00:00:00', '2024-12-31 23:59:00', '2024-06-17 09:00:00', '2024-06-17 12:00:00', 1),
(15, 37, 15, '初階', '台中', '15-1.png', '四季百變小塔研究室｜一次學會 8 種塔皮＋12 款小塔', '用四季 12 款風味小塔，一次學會 8 種塔皮、多種內餡與裝飾，百搭變化出你的創意小塔。甜點即是科學，只要掌握原理，法式小塔輕鬆做！', 1580, '2024-01-01 00:00:00', '2024-12-31 23:59:00', '2024-06-25 11:00:00', '2024-06-25 14:00:00', 1),
(16, 34, 16, '初階', '桃園', '16-1.png', '歐式 x 萬惡麵包大對決｜創意麵包研究室', '這堂課將滿足你對麵包的所有想像！ 傳統硬歐包、台式軟歐包、包餡爆漿麵包、水果麵團創意麵包... 多種麵團、造型、技術、風味變化一次全學會！趕快加入張錫源老師的「歐式 x 萬惡｜麵包大對決」實驗室吧！', 1680, '2024-01-01 00:00:00', '2024-12-31 23:59:00', '2024-07-05 15:00:00', '2024-07-05 18:00:00', 1),
(17, 36, 17, '高階', '桃園', '17-1.png', '乳酪世界甜點課｜六國經典甜點', '用乳酪甜點環遊世界！威達老師教學20款以上甜點，帶領大家遊歷3大洋、5大洲，無論是經典的乳酪甜點，或是排隊名店的創意甜點，都能輕鬆製作！', 3780, '2024-01-01 00:00:00', '2024-12-31 23:59:00', '2024-07-20 12:00:00', '2024-07-20 16:00:00', 1),
(18, 34, 18, '高階', '台北', '18-1.png', '天然風味烘焙所｜冠軍的23款鬆軟手作麵包', '歐式麵包國手楊世均首次公布酵母、自製老麵、溫度、時間黃金比例秘方！ 從自製酵母發酵麵糰、到取代砂糖的無負擔微糖麵包做法，甚至嚴選果香餡料的在地水果風情，讓純粹天然美味從麵包烘焙的麥香氣中併發。 入口夢幻又溫醇的滋味，加上鬆軟綿密的麵包，這就是麵包冠軍經營10年的真功夫！', 3100, '2024-01-01 00:00:00', '2024-12-31 23:59:00', '2024-07-30 10:00:00', '2024-07-30 14:00:00', 1),
(19, 31, 19, '初階', '台中', '19-1.png', '百變戚風蛋糕 - 烘焙初心者殿堂', '戚風蛋糕口感鬆軟綿密，是台灣人很喜歡吃的蛋糕種類之一 這堂課會教你如何做出漂亮且口感蓬鬆的戚風蛋糕，此外還會教你不同的蛋糕變化，不論送禮或是自己吃、或做給孩子吃都非常適合喔！', 1400, '2024-01-01 00:00:00', '2024-12-31 23:59:00', '2024-08-10 15:00:00', '2024-08-10 15:00:00', 1),
(20, 31, 20, '中階', '桃園', '20-1.png', '米其林三星主廚教你做！時尚法式甜點的秘密', '首次公開「Hin 任樂軒」的法式甜點，Chef Hin 全程教你做，烘焙新手也能掌握配方比例、裝飾技巧。將一步步帶你，做出漂亮的美味法式甜點，療癒無法外出的心∼', 2600, '2024-01-01 00:00:00', '2024-12-31 23:59:00', '2024-08-24 12:00:00', '2024-08-24 15:00:00', 1),
(21, 31, 21, '初階', '台北', '21-1.png', '【純植物甜點烘焙課】從心歸零，一起進入純植物甜點的世界！', '讓《GREEN BAKERY 綠帶純植物烘焙》主廚 Isabella 帶我們將大自然的美好揉進甜點中， 從植物原料中理出製作純植甜點的原理，自由交織成餐桌上的百道甜點，透過味覺的傳遞實踐對於地球的永續關懷！', 1350, '2024-01-01 00:00:00', '2024-12-31 23:59:00', '2024-09-15 09:00:00', '2024-09-15 12:00:00', 1),
(22, 31, 22, '中階', '桃園', '22-1.png', '威力｜法式常溫甜點的日常練習', '經典的法式常溫甜點課！ 帶你從烘焙知識愛上作甜點，一起享受烘焙的幸福感吧！', 2500, '2024-01-01 00:00:00', '2024-12-31 23:59:00', '2024-09-23 15:00:00', '2024-09-23 18:00:00', 1),
(23, 31, 23, '高階', '台北', '23-1.png', '吃出甜甜台灣味：主廚Hank的茶 X 法式甜點', '**用台灣水果與茶葉做出法式甜點** 當炭焙香氣濃厚的鐵觀音遇上酸甜清爽的紅心芭樂，兩者會碰撞出什麼火花?有別於市面上常見口味單一的蛋糕，我們在課程中會教大家做出變化豐富的慕斯蛋糕。用不同口味慕斯與戚風蛋糕體層層堆疊，再加上水果內餡與台灣茶，產出令人意想不到的美味。 在這堂課中，不但能從基礎開始學習法式甜點的精髓，像是常用於蛋糕內裡的戚風蛋糕要怎麼烤?香緹奶油的打法與擠花變化技巧、甜麵團塔皮的製作，到進階課程：巧克力鏡面的製作與淋面技巧、如何將茶與巧克力融合...等，以及常被忽略的蛋糕裝飾技巧，都會毫不保留的在課程中公開。不論是烘焙新手或是老手，你所遇到的烘焙痛點、讓你裹足不前的問題，都能透過課程得到解答。烘焙的學習不在多而在精。掌握好這四款各具特色的甜點製作技巧，就能走得更長遠。', 3880, '2024-01-01 00:00:00', '2024-12-31 23:59:00', '2024-10-15 13:00:00', '2024-10-15 16:00:00', 1),
(24, 31, 24, '初階', '台中', '24-1.png', '零失敗的甜點必修｜拿拿摳帶你理解原理、掌握技巧、破解模糊狀態', '人人都能上手的新手友善甜點課，不僅學會實作17道甜點，更了解烘培原理、掌握技巧~', 1880, '2024-01-01 00:00:00', '2024-12-31 23:59:00', '2024-10-22 09:00:00', '2024-10-22 12:00:00', 1);

-- --------------------------------------------------------

--
-- 資料表結構 `coupon`
--

CREATE TABLE `coupon` (
  `coupon_id` int(6) UNSIGNED NOT NULL,
  `coupon_name` varchar(50) NOT NULL,
  `coupon_type` varchar(10) NOT NULL,
  `coupon_discount` float NOT NULL,
  `coupon_purchase` int(6) NOT NULL,
  `coupon_createtime` datetime NOT NULL,
  `coupon_starttime` datetime NOT NULL,
  `coupon_limittime` datetime NOT NULL,
  `coupon_count` int(11) NOT NULL,
  `coupon_status` tinyint(4) NOT NULL,
  `coupon_description` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `coupon`
--

INSERT INTO `coupon` (`coupon_id`, `coupon_name`, `coupon_type`, `coupon_discount`, `coupon_purchase`, `coupon_createtime`, `coupon_starttime`, `coupon_limittime`, `coupon_count`, `coupon_status`, `coupon_description`) VALUES
(1, '九折卷', 'off', 0.9, 100, '2024-02-01 13:38:08', '2024-02-02 00:00:00', '2024-02-08 00:00:00', 2, 0, '滿百後打九折吧'),
(2, '滿千折百卷', 'minus', 100, 1000, '2024-01-31 13:40:19', '2024-01-02 13:40:19', '2024-01-09 13:40:19', 1, 1, '滿千折百'),
(3, '滿千折百卷', 'minus', 100, 1000, '2024-01-31 13:45:59', '2024-01-09 13:45:59', '2024-01-16 13:45:59', 3, 0, '消費滿一千折一百'),
(4, '九折卷', 'off', 0.9, 100, '2024-01-31 13:47:18', '2024-03-01 13:47:18', '2024-03-09 13:47:18', 5, 1, '消費滿百打九折'),
(5, '滿百折十卷', 'minus', 10, 100, '2024-01-31 13:48:19', '2024-02-01 13:48:19', '2024-02-15 13:48:19', 4, 1, '消費滿一百折十'),
(6, '八折卷', 'off', 0.8, 500, '2024-01-31 13:50:21', '2024-01-01 13:50:21', '2024-01-08 13:50:21', 2, 1, '消費滿五百打八折'),
(7, '滿兩千折兩百卷', 'minus', 200, 2000, '2024-01-31 13:51:26', '2024-07-14 13:51:26', '2024-01-21 13:51:26', 2, 1, '滿兩千折兩百'),
(8, '滿千折百卷', 'minus', 100, 1000, '2024-01-31 13:53:20', '2024-02-01 13:53:20', '2024-02-10 13:53:20', 10, 0, '滿一千折一百'),
(9, '七折卷', 'off', 0.7, 1000, '2024-01-31 13:53:58', '2024-03-01 00:00:00', '2024-03-03 00:00:00', 7, 1, '滿一千打七折 可從三月一號用到三月三號'),
(10, '九折卷', 'off', 0.9, 500, '2024-01-31 13:55:39', '2024-01-01 13:55:39', '2024-01-09 13:55:39', 3, 0, '滿五百打九折'),
(11, '九折卷', 'off', 0.9, 1000, '2024-01-31 13:57:23', '2024-01-01 00:00:00', '2024-01-08 00:00:00', 4, 1, '滿一千折打九折'),
(12, '滿五百折五十卷 ', 'minus', 50, 500, '2024-01-31 14:03:21', '2024-01-08 14:03:21', '2024-01-15 14:03:21', 5, 1, '滿五百折五十'),
(13, '九折卷', 'off', 0.9, 1000, '2024-01-31 14:04:36', '2024-01-02 14:04:36', '2024-01-20 14:04:36', 0, 1, '滿一千打九折'),
(14, '滿千折百卷', 'minus', 100, 1000, '2024-01-31 14:05:47', '2024-02-09 14:05:47', '2024-02-17 14:05:47', 10, 1, '滿一千折一百'),
(15, '滿千折百卷', 'minus', 100, 1000, '2024-01-31 14:07:50', '2024-02-09 14:07:50', '2024-02-17 14:07:50', 6, 1, '滿一千折一百'),
(16, '滿百折十卷', 'minus', 10, 100, '2024-01-31 14:15:54', '2024-01-15 14:15:54', '2024-01-18 14:15:54', 10, 1, '滿一百折十'),
(17, '九折卷', 'off', 0.9, 500, '2024-01-31 14:17:12', '2024-06-06 14:17:12', '2024-06-15 14:17:12', 3, 1, '滿五百打九折'),
(18, '滿千折百卷', 'minus', 100, 1000, '2024-01-31 14:19:23', '2024-09-01 14:19:23', '2024-09-21 14:19:23', 3, 1, '滿一千折一百'),
(19, '滿兩千折兩百卷', 'minus', 200, 2000, '2024-01-31 14:20:21', '2024-02-05 14:20:21', '2024-02-10 14:20:21', 2, 1, '滿兩千折兩百'),
(20, '七折卷', 'off', 0.7, 2000, '2024-01-31 14:21:10', '2024-03-01 14:21:10', '2024-03-15 14:21:10', 2, 1, '滿兩千打七折'),
(21, '滿五百折五十券', 'minus', 50, 500, '2024-02-01 13:51:53', '2024-03-07 00:00:00', '2024-03-15 00:00:00', 5, 0, '三月七號至三月十四的五百折五十券'),
(22, '七折券', 'off', 0.7, 1000, '2024-02-01 13:53:45', '2024-02-22 00:00:00', '2024-02-29 00:00:00', 3, 0, '二月二十二至二月二十九號可用的打七折券喔'),
(23, '八折券', 'off', 0.8, 500, '2024-02-01 16:03:43', '2024-02-14 00:00:00', '2024-02-21 00:00:00', 7, 0, '滿五百打八折券');

-- --------------------------------------------------------

--
-- 資料表結構 `product`
--

CREATE TABLE `product` (
  `product_id` int(6) UNSIGNED NOT NULL,
  `product_name` varchar(30) NOT NULL,
  `product_price` int(6) NOT NULL,
  `product_count` int(3) NOT NULL,
  `product_createtime` datetime NOT NULL,
  `product_updatetime` datetime NOT NULL,
  `product_valid` int(1) NOT NULL,
  `category_id_fk` int(2) NOT NULL,
  `subcategory_id_fk` int(2) NOT NULL,
  `product_description` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `product`
--

INSERT INTO `product` (`product_id`, `product_name`, `product_price`, `product_count`, `product_createtime`, `product_updatetime`, `product_valid`, `category_id_fk`, `subcategory_id_fk`, `product_description`) VALUES
(1, '焦糖布丁千層', 300, 15, '2024-01-01 12:47:00', '2024-05-23 13:09:02', 0, 2, 6, '雙層布丁夾餡，金黃布丁搭配濃郁焦糖布丁，獨家技術保留布丁風味，Q彈滑順的口感入口即化，本商品「蛋奶素」可食\r\n各大媒體爭相報導，眾藝人爭相品嚐！'),
(2, '法芙娜可可千層', 400, 10, '2024-01-01 13:07:00', '2024-01-01 13:07:00', 1, 2, 6, '嚴選法國殿堂級精品法芙娜100%可可粉，感受細緻濃郁可可香氣，融合貝禮詩奶酒微醺酒香點綴，打造征服味蕾的極致享受。'),
(3, '藍莓甜心千層', 500, 9, '2024-01-01 13:27:00', '2024-01-01 13:27:00', 1, 2, 6, '手工特製藍莓果醬，雙層的藍莓餡料是最大特點，滿滿的藍莓香氣和微微果酸，口感柔軟滑順且吃的到果粒各大媒體爭相報導，眾藝人爭相品嚐！'),
(4, '抹茶紅豆千層', 500, 8, '2024-01-01 13:47:00', '2024-01-01 13:47:00', 0, 2, 6, '嚴選日本靜岡純正抹茶粉，中間夾入厚厚的蜜紅豆餡，紅豆與抹茶的經典搭配，讓蛋糕整體口感層次更加豐富'),
(5, 'OREO千層', 600, 6, '2024-01-01 14:07:00', '2024-01-01 14:07:00', 1, 2, 6, '風靡世界50年的經典餅乾，OREO擄獲各年齡層的芳心，與鮮奶油、岩燒蛋皮黃金比例融合，口感豐富，充滿濃郁可可香氣。'),
(6, '蜂蜜彩虹千層', 700, 20, '2024-01-01 14:27:00', '2024-01-01 14:27:00', 1, 2, 6, '以蜂蜜及黃梔子果實萃取之天然食用色素為原料製作，粉嫩色系的彩虹剖面，吸睛度100%，甜甜的蜂蜜香氣中帶點酒香，口味獨特。'),
(7, '岩燒提拉千層', 700, 15, '2024-01-01 14:47:00', '2024-01-01 14:47:00', 1, 2, 6, '採正統義式提拉米蘇作法，內餡夾入沾滿咖啡液的手指餅，微苦可可粉中有著濃郁的咖啡香氣。'),
(8, '濃芋香緹千層', 400, 5, '2024-01-01 15:07:00', '2024-01-01 15:07:00', 1, 2, 6, '嚴選新鮮芋頭採用傳統蒸煮方式，保留鬆軟口感以及獨特的香味，添加鮮奶油增添滑順口感'),
(9, '貝里斯牛奶千層', 500, 15, '2024-01-01 15:27:00', '2024-01-01 15:27:00', 1, 2, 6, '品嚐最原始風味的岩燒千層，內餡添加貝禮詩奶酒提味，每一口都充滿著濃郁奶香'),
(10, '草莓多千層', 500, 30, '2024-01-01 15:47:00', '2024-01-01 15:47:00', 1, 2, 6, '嚴選大湖新鮮草莓產地直送，雙層新鮮草莓酸酸甜甜好滋味，各大媒體爭相報導，眾藝人爭相品嚐！'),
(11, '檸檬蜂蜜千層', 500, 30, '2024-01-01 16:07:00', '2024-01-01 16:07:00', 1, 2, 6, '嚴選屏東優利卡四季檸檬，鮮榨萃取保留完整檸檬營養，主廚特製檸檬蜂蜜慕斯，搭配檸檬凍丁清新爽口。'),
(12, 'A款綜合千層', 1000, 5, '2024-01-01 16:27:00', '2024-01-01 16:27:00', 1, 2, 6, '精選超人氣暢銷口味一次滿足四種味蕾，A款綜合：蕾雅起士+牛奶+巧克力+岩燒提拉'),
(13, 'B款綜合千層', 1000, 5, '2024-01-01 16:47:00', '2024-01-01 16:47:00', 1, 2, 6, '精選超人氣暢銷口味一次滿足四種味蕾\nB款綜合：蕾雅起士+巧克力+芒果奶凍+英式伯爵'),
(14, '焦糖海鹽千層', 500, 10, '2024-01-01 17:07:00', '2024-01-01 17:07:00', 1, 2, 6, '自熬煮焦糖海鹽醬調製焦糖海鹽香緹，濃郁的焦糖香緹加入一些海鹽提味，不過甜過鹹，甜鹹有致'),
(15, '楓糖鮮奶千層', 600, 20, '2024-01-01 17:27:00', '2024-01-01 17:27:00', 1, 2, 6, '以加拿大楓糖調和滑順爽口鮮奶油，調製成楓糖香提，層層抹入柔軟千層薄餅當中，享受單純千層薄餅與香緹的層次感'),
(16, '提拉米蘇千層', 450, 15, '2024-01-01 17:47:00', '2024-01-01 17:47:00', 1, 2, 6, '以香濃爽口的馬斯卡邦白乳酪，調和咖啡酒和濃縮咖啡，不同於即溶咖啡粉的刺激，咖啡香醇滑順，中間夾入兩層巧克力醬，綿密香濃的可可香'),
(17, '草莓提拉米蘇千層', 600, 25, '2024-01-01 18:07:00', '2024-01-01 18:07:00', 1, 2, 6, '濃郁的馬斯卡彭帶入冬季口感 搭配盛產的台灣草莓平衡風味  ，濃郁卻清爽酸甜的組合 口感綿密卻不膩口，是甜蜜溫暖的冬季想像'),
(18, '焦糖蘋果乳酪千層', 800, 25, '2024-01-01 18:27:00', '2024-01-01 18:27:00', 1, 2, 6, '自熬的的焦糖海鹽醬，搭配蘋果丁與奶油乳酪餡，焦糖的鹹甜與蘋果的清脆，每一口都讓人驚豔'),
(19, '楓糖香蕉千層', 600, 10, '2024-01-01 18:47:00', '2024-01-01 18:47:00', 1, 2, 6, '以楓糖香提為基底，抹入層層柔順滑嫩千層薄餅，夾入一層厚切新鮮香蕉切片，高雅楓糖香與香蕉香味相融'),
(20, '蜜蘋鐵觀音千層', 500, 20, '2024-01-01 19:07:00', '2024-01-01 19:07:00', 1, 2, 6, '炭焙鐵觀音與富士蜜蘋果相遇，是讓男士愛上的經典口味，內含鐵觀音茶、蜜蘋果，口感清香不厚重'),
(21, '純藍莓千層', 400, 20, '2024-01-01 19:27:00', '2024-01-01 19:27:00', 1, 2, 6, '當季新鮮藍莓混合香濃藍莓醬，稍甜最老少咸宜的家庭品項，內含藍莓、藍莓果醬、藍莓鮮奶油，口感酸甜清爽'),
(22, '綜合水果千層', 650, 15, '2024-01-01 19:47:00', '2024-01-01 19:47:00', 1, 2, 6, '清爽內餡與嚴選水果的完美結合 ，最具豐富滋味與口感 代表稍甜的經典人氣款，內含草莓、香蕉、奇異果、卡士達鮮奶油，口感酸甜且豐富'),
(23, '榛果太妃糖千層', 700, 25, '2024-01-01 20:07:00', '2024-01-01 20:07:00', 1, 2, 6, '榛果風味的咖啡香氣，配上香濃順口的太妃糖內餡，點綴著經典鹽之花做提味，是2024春季不可錯過的最新單品'),
(24, '百香果千層', 600, 10, '2024-01-01 20:27:00', '2024-01-01 20:27:00', 1, 2, 6, '柔軟蛋皮中夾入手煮百香果醬，吃得到百香果籽脆脆的口感，酸甜果醬與香濃奶油的結合展現了迷人風采'),
(25, '莓果乳酪千層', 500, 10, '2024-01-01 20:47:00', '2024-01-01 20:47:00', 1, 2, 6, '當酸甜莓果和香醇乳酪相遇，粉嫩嫩外觀喚醒了沈睡已久的少女心，呈現出豐富口感與層次讓人回味無窮'),
(26, '玫瑰荔枝千層', 750, 10, '2024-01-01 21:07:00', '2024-01-01 21:07:00', 1, 2, 6, '清甜荔枝果香與淡雅玫瑰花香融入卡士達醬中，夾層中加上覆盆苺脆粒，咀嚼時微酸微脆的口感，最後以唇舌間餘留的清香氣息作為甜蜜的結尾'),
(27, '檸檬千層', 800, 30, '2024-01-01 21:27:00', '2024-01-01 21:27:00', 1, 2, 6, '新鮮檸檬加上蛋及奶油，酸甜好吃的檸檬醬內餡，就是以這麼簡單的原料，讓您每一口都回味無窮'),
(28, '長頸鹿可可千層', 400, 10, '2024-01-01 21:47:00', '2024-01-01 21:47:00', 1, 2, 6, '苦甜可可鮮奶油層層堆疊出濃郁滋味，表層獨創的長頸鹿圖案，讓您同時擁有視覺與味覺的雙重享受'),
(29, '豹紋可可千層', 400, 10, '2024-01-01 22:07:00', '2024-01-01 22:07:00', 1, 2, 6, '麥吉的招牌千層蛋糕之一，不膩口的鮮奶油內餡再擠上一圈圈的巧克力風味醬，配上獨創的豹紋圖案 讓您有不同的感受'),
(30, '栗子蒙布朗塔', 900, 15, '2024-01-02 12:47:00', '2024-01-02 12:47:00', 1, 4, 19, '鬆軟的杏仁奶油蛋糕， 鮮奶油香緹與糖漬栗子，蜂蜜蛋糕的甜蜜，撼動你的味覺。'),
(31, '摩卡巧克力塔', 1000, 15, '2024-01-02 13:17:00', '2024-01-02 13:17:00', 0, 4, 16, '咖啡與巧克力的經典搭配，充滿乳香的卡邦起司，酥脆的可可塔皮，滑順的生巧可力'),
(32, '酸溜溜檸檬塔', 900, 20, '2024-01-02 13:47:00', '2024-01-02 13:47:00', 1, 4, 18, '細細攪拌熬煮，成為我們自豪的酸溜溜檸檬塔，使用法國AOP產區伊斯尼發酵奶油，最美味的食材搭配細心製作'),
(33, '抹茶白巧克力塔', 800, 30, '2024-01-02 14:18:00', '2024-01-02 14:18:00', 1, 4, 16, '使用法芙娜白巧克力與法國依思妮鮮奶油的完美融合，再加上麥吉嚴選靜岡抹茶，無情衝擊你的味蕾'),
(34, '有機桑椹乳酪塔', 1200, 8, '2024-01-02 14:48:00', '2024-01-02 14:48:00', 1, 4, 15, '香酥甜塔皮配上有機桑椹細心熬煮，最後融合德國不萊梅乳酪，讓吃過就無法忘懷'),
(35, '香蕉巧克布朗尼塔', 900, 4, '2024-01-02 15:18:00', '2024-01-02 15:18:00', 1, 4, 16, '法芙娜巧克力烘烤而成布朗尼蛋糕， 細心堆疊新鮮香蕉，法芙娜巧克力甘納許與酥脆的杏仁粒，是香蕉與巧克力的絕妙組合！'),
(36, '綠葡萄蜂蜜優格塔', 1000, 20, '2024-01-02 15:48:00', '2024-01-02 15:48:00', 1, 4, 15, '當 季 綠 葡 萄 的 甜 蜜 美 味，使 用 紅 柴 蜂 蜜 / 奶 油 乳 酪 / 依 思 尼 奶 油，創 造 獨 特 奶 香 乳 酪 香 氣 ，覆 盆 子 奶 醬 增 添 細 膩 的 酸 味'),
(37, '鹽之花焦糖胡桃塔', 1000, 30, '2024-01-02 16:19:00', '2024-01-02 16:19:00', 1, 4, 19, '濃醇可可香氣搭配入口即化的生巧克力，每日現烤的鹽之花焦糖胡桃，鹹甜滋味令人難忘，這款是我們的經典口味'),
(38, '草莓起司塔', 1100, 30, '2024-01-02 16:49:00', '2024-01-02 16:49:00', 1, 4, 15, '酥脆的甜塔皮與濃郁的巴斯克蛋糕，酸奶起司優格增添酸味，與季節限定的大湖草莓是絕妙組合'),
(39, '草莓卡士達塔', 1200, 35, '2024-01-02 17:19:00', '2024-01-02 17:19:00', 1, 4, 15, '酥脆的甜塔皮，香草卡士達，酸甜的台灣草莓永遠是最經典的組合，完美結合並帶來難以抗拒的草莓蛋糕味蕾饗宴！'),
(40, '梔子百香烏龍茶塔', 1300, 20, '2024-01-02 17:49:00', '2024-01-02 17:49:00', 1, 4, 15, '以酸甜滋味開頭，香緹、奶凍、奶餡創造多層次，口感將百香果與烏龍茶獨特的香氣完美揉合，最後以淡淡茶味收斂整趟味蕾之旅'),
(41, '澎湃水果塔', 1200, 20, '2024-01-02 18:20:00', '2024-01-02 18:20:00', 1, 4, 15, '將當季水果層層堆疊，以荔枝香緹、原味乳酪、藍莓杏奶餡、原味塔皮襯托新鮮水果，每一口都交融出引人入勝的好滋味。'),
(42, '碧螺春生巧克力塔', 1100, 15, '2024-01-02 18:50:00', '2024-01-02 18:50:00', 1, 4, 16, '茶粉都是來自台灣當地的茶農，無毒無添加農藥，碧螺春是台灣種植的綠茶裡我認為是最有特色的，茶香帶有淡淡豆香，入口先苦後甘'),
(43, '烏龍檸檬塔', 1150, 15, '2024-01-02 19:20:00', '2024-01-02 19:20:00', 1, 4, 18, '黃金烏龍的茶湯呈現金黃色，，輕焙火，味道醇厚，有強烈果實香，一入口會先是檸檬的酸甜，再來烏龍的香氣會在嘴巴裡滿滿散發，有越吃越香的感覺'),
(44, '櫻花乳酪派', 900, 10, '2024-01-02 19:50:00', '2024-01-02 19:50:00', 1, 4, 17, '將櫻花溶入乳酪中 搭配脆口厚實的塔皮 ，底層加上酸酸甜甜的覆盆子醬 中和乳酪的膩感 ，外觀再點綴上讓人充滿幸福浪漫的櫻花，重點不甜膩'),
(45, '北海道生起士塔', 1000, 10, '2024-01-02 20:21:00', '2024-01-02 20:21:00', 1, 4, 17, '使用日本北海道十勝產地直送的新鮮乳酪，純淨高貴，乳脂豐富，起司中的奶香在舌尖流串，牽引著巧克力派皮的溫厚香氣。'),
(46, '紅茶藍莓塔', 1100, 10, '2024-01-03 20:20:00', '2024-01-03 20:20:00', 1, 4, 15, '無比香酥的手?塔皮，藍寶石閃耀般的新鮮藍莓，特製溶合法芙娜白巧克力的紅茶香醍液，柔和滑順口感，香甜微酸讓人無法抗拒的驚艷甜食！'),
(47, '經典黃金貝果', 40, 20, '2024-01-03 20:40:00', '2024-01-03 20:40:00', 1, 1, 1, '嚴選歐洲進口頂級酵母，十年研發，低溫長時間發酵，外皮薄脆、內心Q軟，不添加防腐劑及香精，讓貝果散發出天然雋永的小麥香氣！'),
(48, '花言巧語', 80, 10, '2024-01-03 21:00:00', '2024-01-03 21:00:00', 1, 1, 1, '嚴選新竹福源顆粒花生醬做為基底，再調和比利時奶油及砂糖，特製的奶油花生醬香氣濃郁，搭配上 KIRKLAND榛果巧克力醬，花生 + 巧克力，超級絕配組合，絕對讓人一吃就愛上！'),
(49, '金莎OREO', 75, 15, '2024-01-03 21:21:00', '2024-01-03 21:21:00', 1, 1, 1, '嚴選德國KIRKLAND柯克蘭榛果巧克力醬與OREO碎片完美融合，是布朗主廚最得意也最熱銷的創意招牌口味！'),
(50, '蔓越莓起司三重奏', 65, 15, '2024-01-03 21:41:00', '2024-01-03 21:41:00', 1, 1, 1, '主廚霸氣撒上滿滿蔓越莓及cream cheese夾心，再披上脆皮起司外衣，外酥內軟，層次感十足。'),
(51, '可可藍莓重乳酪', 60, 20, '2024-01-03 22:02:00', '2024-01-03 22:02:00', 1, 1, 1, '主廚親自挑選指定頂級野生藍莓製作果醬，再佐以特濃cream cheese增添香氣與口感，重本嚴選食材，打造極致的經典美味。'),
(52, '原味奶油草莓', 60, 12, '2024-01-03 22:22:00', '2024-01-03 22:22:00', 1, 1, 1, '經典黃金原味貝果+美國進口頂級奶油+法國進口天然草莓果醬，這樣無敵美味的組合，絕對是經典熱銷款！'),
(53, '海派甜心', 60, 13, '2024-01-03 22:42:00', '2024-01-03 22:42:00', 1, 1, 1, '海鹽焦糖+頂級進口特濃cream cheese+綜合堅果，嚐一口，便會驚艷於主廚創造的極致美味。'),
(54, '原味肉桂捲', 80, 20, '2024-01-04 19:17:00', '2024-01-04 19:17:00', 1, 1, 2, '使用湯種麵團，有別於一般單純的甜麵包，低溫長時間發酵不僅讓麵包體延遲老化，更是讓麵糰風味倍增。'),
(55, '糖霜肉桂捲', 100, 20, '2024-01-04 19:32:00', '2024-01-04 19:32:00', 1, 1, 2, '原味肉桂捲淋上半透明糖霜，捲了三圈的完美比例讓口感兼具柔軟和扎實，質地像蛋糕般細緻，從中藥房採買兩種肉桂粉調配出優雅溫和的香氣和甜味，即時不偏愛肉桂的朋友也無法抗拒這誘人的滋味！'),
(56, '奶油起司肉桂捲', 100, 12, '2024-01-04 19:47:00', '2024-01-04 19:47:00', 1, 1, 2, '經典美式口味，肉桂捲上層抹上厚厚的一層奶油起司抹醬，口感更綿密。'),
(57, '經典原味司康', 60, 20, '2024-01-04 20:03:00', '2024-01-04 20:03:00', 1, 1, 3, '司康經典口味，感受單純的麵粉、雞蛋、奶油的香氣。'),
(58, '蔓越莓司康', 80, 23, '2024-01-04 20:18:00', '2024-01-04 20:18:00', 1, 1, 3, '熱門經典口味，酸甜蔓越梅乾增添司康口感。'),
(59, '蜂蜜萊姆司康', 80, 15, '2024-01-04 20:34:00', '2024-01-04 20:34:00', 1, 1, 3, '使用日本北海道十勝產地直送的新鮮蜂蜜，純淨高貴，香氣豐富，牽引著檸檬派皮的溫厚香氣。'),
(60, '草莓優格司康', 100, 30, '2024-01-04 20:49:00', '2024-01-04 20:49:00', 1, 1, 3, '使用鮮乳坊優格取代牛奶，吃起來更為清爽，大粒酸甜的天然草莓乾，最受少女喜歡的口味。'),
(61, '可可豆司康', 90, 32, '2024-01-04 21:04:00', '2024-01-04 21:04:00', 1, 1, 3, '使用法芙娜可可粉，濃厚可可香氣，拌入不甜膩的巧克力豆，豐富口感深受巧克力迷喜愛。'),
(62, '肉桂葡萄司康', 90, 10, '2024-01-04 21:20:00', '2024-01-04 21:20:00', 1, 1, 3, '清甜的肉桂粉與葡萄乾搭配，是肉桂初階者也能嘗試的口味。'),
(63, '太妃糖海鹽司康', 90, 15, '2024-01-04 21:35:00', '2024-01-04 21:35:00', 1, 1, 3, '結合了太妃糖的香甜和鬆軟的斯康口感，成為一款令人愛不釋手的糕點'),
(64, 'OREO司康', 100, 23, '2024-01-04 21:51:00', '2024-01-04 21:51:00', 1, 1, 3, '將Oreo餅乾的濃郁巧克力與香滑的奶油夾心融入鬆軟的斯康中，打造出一款令人垂涎的點心。'),
(65, '鹹起司司康', 95, 34, '2024-01-04 22:06:00', '2024-01-04 22:06:00', 1, 1, 3, '外皮金黃酥脆，內部則充滿了起司的香氣。結合了鹹味和濃郁芝士風味的糕點。'),
(66, '流淚吐司', 80, 30, '2024-01-05 06:14:00', '2024-01-05 06:14:00', 1, 1, 4, '使用日本進口麵粉與濃醇香的鮮奶相互結合,柔軟綿密又濕潤的風味在舌尖蔓延,是讓人感動到流淚的迷人滋味。'),
(67, '絕對芋仔吐司', 100, 25, '2024-01-05 06:26:00', '2024-01-05 06:26:00', 1, 1, 4, '自製的芋泥餡吃得到實在的芋頭顆粒揉入柔軟細緻的吐司麵團,每一口都有著濃濃的芋頭香氣,'),
(68, '爆炸菠蘿頭吐司', 100, 15, '2024-01-05 06:38:00', '2024-01-05 06:38:00', 1, 1, 4, '撥開後裏頭的粉紅色深深地令人著迷,自家熬煮的覆盆子果泥和柔軟的麵團和在一起,包裹著充滿奶香的蔓越莓奶酥餡'),
(69, '巧克力爆炸菠蘿頭吐司', 120, 35, '2024-01-05 06:50:00', '2024-01-05 06:50:00', 0, 1, 4, '選用法國進口的米歇爾可可粉和吐司麵團均勻混合，裏頭包著滿滿香濃苦甜的比利時54.5%巧克力，大口咬下可以享受到三種驚喜口感'),
(70, '黃金三起士爆炸頭吐司', 150, 32, '2024-01-05 07:03:00', '2024-01-05 07:03:00', 1, 1, 4, '由外到內佈滿濃郁起士，讓口感、鹹香、奶香達成完美三重奏，展現出富有層次的起士風味，一次擄獲各年齡層的芳心！'),
(71, '柑橘吐司', 120, 25, '2024-01-05 07:15:00', '2024-01-05 07:15:00', 1, 1, 4, '天然酸甜的蜜漬橘皮丁，均勻混入充滿奶香的吐司麵團中，清新回甘的香氣讓人一口接一口'),
(72, '黑糖核桃葡萄吐司', 110, 15, '2024-01-05 07:27:00', '2024-01-05 07:27:00', 1, 1, 4, '樸實黑糖甜味配上核桃堅果及香甜葡萄乾，真材實料的搭配，人氣必吃款讓您吃一口就愛上'),
(73, '黑芝麻吐司', 100, 5, '2024-01-05 07:39:00', '2024-01-05 07:39:00', 1, 1, 4, '濃厚黑芝麻醬均勻揉入軟綿細緻的吐司麵團中，香氣四溢讓人難以抗拒，也是人氣必嚐單品'),
(74, '全麥五穀米吐司', 90, 3, '2024-01-05 07:52:00', '2024-01-05 07:52:00', 1, 1, 4, '嚴選山茶花麵粉製作柔軟的吐司麵團加入充滿營養價值的五穀米，不但健康、營養更是充滿天然樸實的香氣'),
(75, '抹茶純戚風蛋糕', 350, 20, '2024-01-07 09:49:00', '2024-01-07 09:49:00', 1, 2, 5, '採用日本丸久小山園抹茶粉，茶香濃厚、香醇不苦，入口即感受滿滿茶香的感動。'),
(76, '草莓純戚風蛋糕', 350, 30, '2024-01-07 10:07:00', '2024-01-07 10:07:00', 1, 2, 5, '將法國進口的新鮮果泥逐漸融入蛋糕中，在夢幻的粉紅色澤下，給您繽紛的甜蜜滋味。'),
(77, '香草純戚風蛋糕', 350, 15, '2024-01-07 10:26:00', '2024-01-07 10:26:00', 1, 2, 5, '身為原味的經典口味，淡雅純粹的香草味與雞蛋香，最能呈現出戚風蛋糕的細緻口感，單純卻扣人心弦。'),
(78, '莓果茶純戚風蛋糕', 350, 10, '2024-01-07 10:44:00', '2024-01-07 10:44:00', 1, 2, 5, '使用風味溫潤，富有多種層次的TWININGS鉑金莓果茶 ，萃取茶葉最美好的風味，再加入大量新鮮莓果，帶來更誘人的口感。'),
(79, '巧克力純戚風蛋糕', 450, 30, '2024-01-07 11:02:00', '2024-01-07 11:02:00', 1, 2, 5, '上選優質高純度巧克力製作，口味、香味、風味兼具的絕讚品，是小朋友們都愛不釋手的招牌口味。'),
(80, '紅茶純戚風蛋糕', 450, 10, '2024-01-07 11:20:00', '2024-01-07 11:20:00', 1, 2, 5, '大量使用英國TWININGS伯爵茶葉，細心地萃取茶葉精華，將色澤、香氣與口感完美融合。'),
(81, '紅茶鮮奶油戚風蛋糕', 650, 15, '2024-01-07 11:39:00', '2024-01-07 11:39:00', 1, 2, 5, '大量使用英國TWININGS伯爵茶葉，細心地萃取茶葉精華，將色澤、香氣與口感完美融合，享受自然純淨的茶香味被完整萃取且包覆在鮮奶油裡面，每一口都讓人驚豔。'),
(82, '巧克力鮮奶油戚風蛋糕', 650, 30, '2024-01-07 11:57:00', '2024-01-07 11:57:00', 1, 2, 5, '上選優質高純度巧克力製作，口味、香味、風味兼具的絕讚品，是小朋友們都愛不釋手的招牌口味。'),
(83, '香草鮮奶油戚風蛋糕', 650, 20, '2024-01-07 12:15:00', '2024-01-07 12:15:00', 1, 2, 5, '身為原味的經典口味，淡雅純粹的香草味與雞蛋香，最能呈現出戚風蛋糕的細緻口感，單純卻扣人心弦'),
(84, '草莓鮮奶油戚風蛋糕', 650, 30, '2024-01-07 12:33:00', '2024-01-07 12:33:00', 1, 2, 5, '將法國進口的新鮮果泥逐漸融入蛋糕中，在夢幻的粉紅色澤下，給您繽紛的甜蜜滋味。'),
(85, '抹茶鮮奶油戚風蛋糕', 650, 20, '2024-01-07 12:52:00', '2024-01-07 12:52:00', 1, 2, 5, '採用日本丸久小山園抹茶粉，茶香濃厚、香醇不苦，入口即感受滿滿茶香的感動。'),
(86, '黑森林夾餡蛋糕', 900, 30, '2024-01-07 13:10:00', '2024-01-07 13:10:00', 1, 2, 5, '純正的法式巧克力蛋糕，內餡為濕潤香甜的進口黑櫻桃，外搭高純度巧克力碎片，值得一再品嘗的經典口味。'),
(87, 'OREO夾餡蛋糕', 900, 30, '2024-01-07 13:28:00', '2024-01-07 13:28:00', 1, 2, 5, '上層將新鮮草莓與迷你OREO餅乾交錯放置，外層覆蓋巧克力的鮮奶油，從頭到尾的香濃美味，讓您難以忘懷。'),
(88, '咖啡千層夾餡蛋糕', 900, 10, '2024-01-07 13:46:00', '2024-01-07 13:46:00', 1, 2, 5, '將分成四層的香草戚風蛋糕刷上濃醇Espresso，堆砌出義式咖啡獨特的香氣與美味，搭配酥脆的核桃夾餡，成熟而獨特的絕妙搭配。'),
(89, '摩卡夾餡蛋糕', 900, 15, '2024-01-07 14:04:00', '2024-01-07 14:04:00', 1, 2, 5, '巧克力口味的戚風蛋糕體，加上外層佈滿獨具特色的咖啡口味鮮奶油，呈現香醇濃郁又滑順的特殊口味。'),
(90, '櫻桃夾餡蛋糕', 1000, 13, '2024-01-07 14:23:00', '2024-01-07 14:23:00', 1, 2, 5, '在 machi 經典的香草戚風上，鋪滿顆粒飽滿的櫻桃果肉，閃耀著如璀璨寶石般的誘人色澤，微酸微甜的口感成為完美的搭配'),
(91, '草莓夾餡蛋糕', 1000, 28, '2024-01-07 14:41:00', '2024-01-07 14:41:00', 1, 2, 5, '在香草戚風蛋糕中夾有一層水蜜桃、一層草莓夾餡，共譜出酸甜的美味合奏曲，給您滿心幸福的經典美味。'),
(92, '原味乳酪蛋糕', 600, 20, '2024-01-08 10:23:00', '2024-01-08 10:23:00', 1, 2, 7, '經典乳酪蛋糕熱賣20年，馥郁濃厚的乳酪口感'),
(93, '巧克力乳酪蛋糕', 700, 23, '2024-01-08 10:40:00', '2024-01-08 10:40:00', 1, 2, 7, '選用義大利頂級品牌DOMORI巧克力，香味獨特，號稱世界九大頂級巧克力之首'),
(94, '抹茶乳酪蛋糕', 700, 15, '2024-01-08 10:57:00', '2024-01-08 10:57:00', 1, 2, 7, '茶園嚴謹紀錄栽種履歷，石臼研磨保留原始茶香'),
(95, '檸檬乳酪蛋糕', 700, 23, '2024-01-08 11:15:00', '2024-01-08 11:15:00', 1, 2, 7, '結合了濃郁的乳酪、柔和的奶油和清新的檸檬風味的美味體驗'),
(96, '蔓越莓生乳酪', 700, 15, '2024-01-08 11:32:00', '2024-01-08 11:32:00', 1, 2, 7, '口感滑順、清新且帶有微酸的甜點，以新鮮的生乳酪和蔓越莓的組合而成。'),
(97, '藍莓生乳酪', 700, 10, '2024-01-08 11:49:00', '2024-01-08 11:49:00', 1, 2, 7, '夏日來臨，想要一款既清新又滑順的甜點來度過炎炎夏日嗎？藍莓生乳酪蛋糕絕對是您的最佳選擇！這款甜點結合了柔滑的生乳酪和酸甜的藍莓，為您帶來一場口感和味覺的盛宴。'),
(98, '覆盆子生乳酪', 700, 12, '2024-01-08 12:07:00', '2024-01-08 12:07:00', 1, 2, 7, '覆盆子的自然風味充滿蛋糕的每一層，帶來細緻而醇厚的果香。每一口都彷彿在品味覆盆子的原汁原味，讓您沉浸在美好的果香中。'),
(99, '葡萄生乳酪', 700, 8, '2024-01-08 12:24:00', '2024-01-08 12:24:00', 1, 2, 7, '葡萄的甜美和水分充沛，為蛋糕注入了自然的甜味和清新的果香。每一顆葡萄彷彿夏日的清風，為整個蛋糕帶來了令人愉悅的口感。'),
(100, '香橙生乳酪', 700, 12, '2024-01-08 12:41:00', '2024-01-08 12:41:00', 1, 2, 7, '每一口蛋糕都彷彿踏上了一場香橙花園之旅，新鮮香橙的香氣在口中綻放。清新而迷人的果香瞬間填滿味蕾，讓人感受到夢幻的果味之旅。'),
(101, '百香果生乳酪', 700, 18, '2024-01-08 12:59:00', '2024-01-08 12:59:00', 1, 2, 7, '百香果的清涼酸甜讓每一口都充滿夏日的口感冒險。清新的口感在炎炎夏日中帶來陣陣涼意，讓人在味蕾間感受到一絲涼爽。'),
(102, '雪釀香芋乳酪蛋糕', 800, 15, '2024-01-08 13:16:00', '2024-01-08 13:16:00', 1, 2, 7, '雪釀和香芋的組合使得蛋糕的口感濕潤而豐滿，每一口都彷彿品味到一片夢幻的仙境。清新中帶著甜蜜，彷如置身於雪釀香芋的夢幻甜園。'),
(103, '美人柑玻尿酸乳酪蛋糕', 1000, 10, '2024-01-08 13:33:00', '2024-01-08 13:33:00', 1, 2, 7, '每一口蛋糕都帶有美人柑的清新風味，彷彿置身於陽光明媚的柑橘園中。清新宜人的柑橘香氣讓整個味蕾瞬間被活化，感受陽光灑在臉上的溫暖。'),
(104, '初夏桑椹乳酪蛋糕', 800, 12, '2024-01-08 13:50:00', '2024-01-08 13:50:00', 1, 2, 7, '桑椹的酸甜帶來清涼感，為初夏的口感冒險增添一份愉悅。每一口都像是在品味季節變換的美好，讓人感受到夏日的美好時光。'),
(105, '朱古力圓舞曲乳酪蛋糕', 1200, 23, '2024-01-08 14:08:00', '2024-01-08 14:08:00', 1, 2, 7, '巧克力的深邃與乳酪的清新相互交融，形成一種層次分明的風味。這樣的味道令人感受到巧克力的豐富層次，帶來愉悅的味蕾饗宴。'),
(106, '草莓玻尿酸生乳酪蛋糕', 1200, 18, '2024-01-08 14:25:00', '2024-01-08 14:25:00', 1, 2, 7, '草莓的酸甜風味與乳酪的滑順口感完美結合，形成一種口感豐盈的風味。每一口都是對味蕾的愉悅與享受，彷彿品味到草莓的獨特美味'),
(107, '天使親吻輕乳酪蛋糕', 800, 30, '2024-01-08 14:42:00', '2024-01-08 14:42:00', 1, 2, 7, '天使親吻輕乳酪蛋糕帶有清新淡雅的香氣，彷彿置身於花園中。每一口都是天使的香氣，令人感受到一絲絲的芬芳和愉悅。'),
(108, '雙層提拉米蘇', 600, 15, '2024-01-09 07:10:00', '2024-01-09 07:10:00', 1, 2, 8, '將手指餅乾浸泡於現磨沖泡濃縮咖啡中，並使用24小時手工熟成馬斯卡邦乳酪混和無菌蛋品及比利時可可粉，雙重乳酪口感，層次豐富飽滿。'),
(109, '原味提拉米蘇', 500, 20, '2024-01-09 07:22:00', '2024-01-09 07:22:00', 1, 2, 8, '將手指餅乾浸泡於現磨沖泡濃縮咖啡中，並使用24小時手工熟成馬斯卡邦乳酪混和無菌蛋品及比利時可可粉，雙重乳酪口感，層次豐富飽滿。'),
(110, '森林派對提拉米蘇', 700, 13, '2024-01-09 07:35:00', '2024-01-09 07:35:00', 1, 2, 8, '將切塊的手指餅乾淋上鮮榨綜合莓果果汁，並使用24小時手工馬斯卡邦乳酪混和無菌蛋品，最上層佐以天然無調味森林莓果'),
(111, '濃情巧克力提拉米蘇', 700, 25, '2024-01-09 07:48:00', '2024-01-09 07:48:00', 1, 2, 8, '蛋糕中的提拉米蘇層次分明，每一層都滑順得如絲。醇香的提拉米蘇風味與巧克力的香氣完美結合，令人陶醉於它的迷人滋味'),
(112, '瑪沙拉酒提拉米蘇', 800, 17, '2024-01-09 08:00:00', '2024-01-09 08:00:00', 1, 2, 8, '每一口蛋糕都彷彿沐浴在醇厚的瑪沙拉酒香氣中。瑪沙拉酒的深邃風味在口中綻放，帶給您沉浸在葡萄園的陶醉感。'),
(113, '經典巴斯克', 600, 35, '2024-01-09 08:13:00', '2024-01-09 08:13:00', 1, 2, 9, '巴斯克乳酪蛋糕的口感平衡，濃郁與清新的結合讓人驚艷。每一口都是風味的深厚之選，帶給您層次豐富的味蕾體驗。'),
(114, '濃巧巴斯克', 700, 40, '2024-01-09 08:26:00', '2024-01-09 08:26:00', 1, 2, 9, '巧克力巴斯克蛋糕口感絲滑，每一口都如絲綢一般柔嫩。巧克力的濃郁與乳酪的滑順完美融合，為味蕾帶來極致的享受。'),
(115, '抹茶巴斯克', 700, 24, '2024-01-09 08:38:00', '2024-01-09 08:38:00', 1, 2, 9, '抹茶巴斯克蛋糕口感滑順，每一口都彷彿在品味抹茶的柔嫩之美。抹茶的獨特風味與乳酪的滑順完美交融，為味蕾帶來極致的享受'),
(116, '重抹茶曲奇', 300, 10, '2024-01-10 18:27:00', '2024-01-10 18:27:00', 1, 3, 11, '小山園重抹茶的抹茶來自小山園，經過嚴格挑選的高品質抹茶。每一口曲奇都彷彿是一杯極致抹茶的味蕾饗宴，清新濃郁的抹茶風味散發出獨特的韻味。'),
(117, '雙倍焦糖曲奇', 350, 12, '2024-01-10 18:41:00', '2024-01-10 18:41:00', 1, 3, 11, '曲奇的外皮金黃酥脆，咬下去卻是內裡濕潤的口感。雙倍焦糖曲奇將酥脆和濕潤相得益彰，為您帶來雙重的口感享受。'),
(118, '鐵觀音曲奇', 300, 15, '2024-01-10 18:55:00', '2024-01-10 18:55:00', 1, 3, 11, '鐵觀音曲奇的茶香滲透在每一片餅乾中，帶給您回味無窮的美好。茶香的濃厚與曲奇的香甜相得益彰，營造出一場深深的茶香之旅。'),
(119, '紅茶拿鐵曲奇', 300, 20, '2024-01-10 19:09:00', '2024-01-10 19:09:00', 1, 3, 11, '曲奇中的紅茶部分選用了深厚的茶葉，香氣撲鼻。每一口都充滿著紅茶的香氣，彷彿置身於茶園，感受到茶葉的獨特風味。'),
(120, '焦糖奶油曲奇', 300, 20, '2024-01-10 19:23:00', '2024-01-10 19:23:00', 1, 3, 11, '焦糖奶油曲奇不僅適合在家中品味，也是任何場合的美味驚喜。慶祝節日、與摯愛共度時光，都是這款曲奇為味蕾帶來驚喜的時刻'),
(121, '重可可曲奇', 350, 30, '2024-01-10 19:37:00', '2024-01-10 19:37:00', 1, 3, 11, '重可可曲奇的濃情巧克力風味令人陶醉，回味無窮。每一口都充滿濃郁的巧克力滋味，讓您沉浸在甜蜜的巧克力之中。'),
(122, '芝麻蝴蝶酥', 300, 10, '2024-01-11 08:30:00', '2024-01-11 08:30:00', 1, 3, 10, '綿密的層次中，感受芝麻的細緻口感與獨有堅果香氣，如此微妙順口。'),
(123, '原味蝴蝶酥', 300, 15, '2024-01-11 08:44:00', '2024-01-11 08:44:00', 1, 3, 10, '酥鬆薄脆，驚人的輕盈，奶油的香氣縈繞，吃一口就無法忘懷。'),
(124, '伯爵茶蝴蝶酥', 300, 18, '2024-01-11 08:58:00', '2024-01-11 08:58:00', 1, 3, 10, '巧妙地將伯爵茶的佛手柑香氣與麵皮完美融合，茶韻奶香，底蘊深長。'),
(125, '焦糖鹽之花蝴蝶酥', 300, 23, '2024-01-11 09:13:00', '2024-01-11 09:13:00', 1, 3, 10, '香甜滑順的焦糖奶油，融合了鑽石般的洲南鹽花，帶出了獨具層次感的回甘鹹味'),
(126, '松露蝴蝶酥', 300, 12, '2024-01-11 09:27:00', '2024-01-11 09:27:00', 1, 3, 10, '黑松露獨特風味與奶油完美揉合，鹹中帶奶的絕妙搭配'),
(127, '巧克力蝴蝶酥', 300, 30, '2024-01-11 09:41:00', '2024-01-11 09:41:00', 1, 3, 10, '使用頂級55%黑巧克力製作，細細品嚐微微融化的迷人可可香氣。】'),
(128, '原味鳳梨酥 ', 210, 20, '2024-01-12 07:10:00', '2024-01-12 07:10:00', 1, 3, 13, '皮薄餡多、鬆香、不黏牙，夾藏著口感細緻的鳳梨美味，輕輕一口就可以感受到精緻茗點。'),
(129, '鳳凰酥', 270, 30, '2024-01-12 07:28:00', '2024-01-12 07:28:00', 1, 3, 13, '精選的散蛋黃，裹上香甜的鳳梨餡，散發濃郁自然風味，豐富的口感讓人回味不已。'),
(130, '蔓越莓鳳梨酥 ', 300, 15, '2024-01-12 07:46:00', '2024-01-12 07:46:00', 1, 3, 13, '台灣第一家獨創以傳統鳳梨餡融入西方食材---蔓越莓餡以及胚芽3種食材，巧妙的結合一起，形成一種最新口味的創意鳳梨酥，是最佳的伴手禮。'),
(131, '胚芽核桃鳳梨酥 ', 300, 5, '2024-01-12 08:04:00', '2024-01-12 08:04:00', 1, 3, 13, '養生新品健康上市，酥軟的外皮裹上營養的胚芽，內含酥脆核桃，營養入口香氛四起。'),
(132, '柴燒龍眼桂圓酥', 300, 3, '2024-01-12 08:23:00', '2024-01-12 08:23:00', 1, 3, 13, '細緻香鬆，龍眼的香味在舌尖蔓延， 香味濃郁令人口齒留香。'),
(133, '梅鳳酥 ', 300, 10, '2024-01-12 08:41:00', '2024-01-12 08:41:00', 1, 3, 13, '細緻香鬆，台灣出口到日本的頂級青梅加入鳳梨餡，美味在舌尖蔓延， 香味濃郁令人口齒留香。'),
(134, '蔓蔓雙拼鳳梨酥', 350, 8, '2024-01-12 08:59:00', '2024-01-12 08:59:00', 1, 3, 13, '原味鳳梨酥+蔓越莓鳳梨酥--各半盒'),
(135, '經典雙拼鳳梨酥', 350, 20, '2024-01-12 09:17:00', '2024-01-12 09:17:00', 1, 3, 13, '原味鳳梨酥+鳳黃酥--各半盒'),
(136, '雙味雙拼鳳梨酥', 350, 25, '2024-01-12 09:36:00', '2024-01-12 09:36:00', 1, 3, 13, '鳳黃酥+蔓越莓鳳梨酥--各半盒'),
(137, '草莓酥', 320, 12, '2024-01-12 09:54:00', '2024-01-12 09:54:00', 1, 3, 13, '細緻香鬆，草莓水果的美味在舌尖蔓延， 香味濃郁令人口齒留香。'),
(138, '哈密瓜酥', 320, 10, '2024-01-12 10:12:00', '2024-01-12 10:12:00', 1, 3, 13, '細緻香鬆，哈密瓜水果的美味在舌尖蔓延， 香味濃郁令人口齒留香。'),
(139, '南棗酥', 300, 9, '2024-01-12 10:30:00', '2024-01-12 10:30:00', 1, 3, 13, '細緻香鬆，黑棗的美味在舌尖蔓延， 香味濃郁令人口齒留香。'),
(140, '小棗泥餅', 300, 10, '2024-01-13 11:18:00', '2024-01-13 11:18:00', 1, 3, 12, '精選上等的黑棗，慢火熬製的棗泥內餡配上酥鬆的餅皮，鍾愛棗泥的朋友們，千萬別錯過'),
(141, '小椰香蛋黃餅 ', 320, 12, '2024-01-13 11:33:00', '2024-01-13 11:33:00', 1, 3, 12, '濃郁的椰香混搭蛋黃奶油之香氣，配上酥鬆的餅皮，讓您吃完忍不住趕緊再回購'),
(142, '小蓮子蛋黃餅', 320, 10, '2024-01-13 11:47:00', '2024-01-13 11:47:00', 1, 3, 12, '蓮子粉絲們的千呼萬喚，終於完成了內餡配比的研製，上等蓮子親自熬製，微甜的香氣，如夏日清爽的徐風，爽口不膩，一口再一口~'),
(143, '波羅蛋黃酥', 350, 15, '2024-01-13 12:02:00', '2024-01-13 12:02:00', 1, 3, 12, '有別以往的傳統酥皮蛋黃酥，外皮如同奶油餅乾的香酥，內餡為自製的紅豆餡以及精選的蛋黃，純手工製作，每日限量供應。'),
(144, '紅豆蛋黃酥', 300, 20, '2024-01-13 12:17:00', '2024-01-13 12:17:00', 1, 3, 12, '外皮多重層次，內餡是自製紅豆餡，皮酥蛋香合而為一，延伸味蕾新觸覺。'),
(145, '棗泥蛋黃酥', 300, 15, '2024-01-13 12:31:00', '2024-01-13 12:31:00', 1, 3, 12, '多層次的酥皮，加入特製棗泥餡及特別嚴選的鹹蛋黃，讓您驚喜連連，讚美有加'),
(146, '鹹蛋黃酥', 270, 20, '2024-01-13 12:46:00', '2024-01-13 12:46:00', 1, 3, 12, '精選綠豆沙加入特製紅蔥酥，加入特別嚴選的鹹蛋黃，皮酥蛋鹹香合而為一，口口感動。'),
(147, '綠豆蛋黃酥', 270, 15, '2024-01-13 13:01:00', '2024-01-13 13:01:00', 1, 3, 12, '綠豆沙中間包覆鹹蛋黃，甜中帶鹹，入口即化，沒吃過就太可惜了!'),
(148, '綠豆小月餅', 250, 18, '2024-01-13 13:16:00', '2024-01-13 13:16:00', 1, 3, 12, '特製綠豆精緻而成，豆沙綿密入口即化，也是素食者福音。'),
(149, '芋泥蛋黃酥', 350, 20, '2024-01-13 13:30:00', '2024-01-13 13:30:00', 1, 3, 12, '多層次的酥皮，加入自製芋泥餡及特別嚴選的鹹蛋黃，讓您驚喜連連，讚美有加！'),
(150, '麻糬餅', 350, 30, '2024-01-13 13:45:00', '2024-01-13 13:45:00', 1, 3, 12, '純手工製作的傳統美食，嚼勁Q彈的麻糬包裏著自製紅豆內餡，經典美味，老少咸宜。'),
(151, '芒果雪花餅', 300, 18, '2024-01-14 06:22:00', '2024-01-14 06:22:00', 1, 3, 14, '採用新鮮芒果乾，口感清爽，適合炎炎夏日 搭配果汁 來上一口的甜點'),
(152, '草莓雪花餅', 300, 19, '2024-01-14 06:41:00', '2024-01-14 06:41:00', 1, 3, 14, '選用韓國草莓乾 搭配濃濃奶香味的牛軋糖，外層灑上一層奶粉 好看又好吃'),
(153, '經典雪花餅', 300, 20, '2024-01-14 07:01:00', '2024-01-14 07:01:00', 1, 3, 14, '濃郁的奶香牛軋糖中帶著酸甜中和了甜膩的糖外表灑上一層奶粉又香又酸甜'),
(154, '抹茶雪花餅', 300, 15, '2024-01-14 07:20:00', '2024-01-14 07:20:00', 1, 3, 14, '口味不喜歡太甜的人可以嘗試這款抹茶口味'),
(155, '巧克力雪花餅', 300, 15, '2024-01-14 07:39:00', '2024-01-14 07:39:00', 1, 3, 14, '巧克力口味的牛軋糖好吃不黏牙，外面灑上苦味的純可可粉，讓整塊雪花餅甜度剛剛好'),
(156, '花生雪花餅', 300, 15, '2024-01-14 07:59:00', '2024-01-14 07:59:00', 1, 3, 14, '選用新竹福源花生醬，咬下去濃郁的花生香氣，加入花生顆粒增添口感，外層灑上香噴噴的花生粉，讓人一口接一口停不下來'),
(157, '肉鬆雪花餅', 300, 12, '2024-01-14 08:18:00', '2024-01-14 08:18:00', 1, 3, 14, '嚴格選用手工翻炒的彰化台灣豬肉鬆花生，肉鬆口味的花生醬選用新竹福源花生醬用料嚴格選用，讓大家每一口都吃得安心'),
(159, '狗狗狗', 1010, 0, '2024-02-09 14:49:36', '2024-02-10 17:00:55', 1, 5, 20, '123'),
(160, '', 0, 0, '2024-02-10 12:32:14', '2024-02-10 12:32:14', 1, 0, 0, ''),
(161, '', 0, 0, '2024-02-10 12:32:36', '2024-02-10 12:32:36', 1, 0, 0, ''),
(162, '', 0, 0, '2024-02-10 12:32:40', '2024-02-10 12:32:40', 1, 0, 0, '');

-- --------------------------------------------------------

--
-- 資料表結構 `product_img`
--

CREATE TABLE `product_img` (
  `product_img_id` int(6) UNSIGNED NOT NULL,
  `product_id_fk` int(6) NOT NULL,
  `product_img_name` varchar(300) NOT NULL,
  `product_img_filename` varchar(300) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `product_img`
--

INSERT INTO `product_img` (`product_img_id`, `product_id_fk`, `product_img_name`, `product_img_filename`) VALUES
(1, 1, '焦糖布丁千層', '1.jpg'),
(2, 2, '法芙娜可可千層', '2.jpg'),
(3, 3, '藍莓甜心千層', '122822003-34.jpg'),
(4, 4, '抹茶紅豆千層', '122820002-33.jpg'),
(5, 5, 'OREO千層', '122817003-31.jpg'),
(6, 6, '蜂蜜彩虹千層', '122811004-32.jpg'),
(7, 7, '岩燒提拉千層', '122803003-32.jpg'),
(8, 8, '濃芋香緹千層', '122809004-32.jpg'),
(9, 9, '貝里斯牛奶千層', '122801003-31.jpg'),
(10, 10, '草莓多千層', '122833003-310.jpg'),
(11, 11, '檸檬蜂蜜千層', '122828008-34.jpg'),
(12, 12, 'A款綜合千層', '122998024-32.jpg'),
(13, 13, 'B款綜合千層', '122998025-33.jpg'),
(14, 14, '焦糖海鹽千層', '20220821125103b940.jpg'),
(15, 15, '楓糖鮮奶千層', '202208111502218d35.jpg'),
(16, 16, '提拉米蘇千層', '202208141857427569.jpg'),
(17, 17, '草莓提拉米蘇千層', '202208141857427000.webp'),
(18, 18, '焦糖蘋果乳酪千層', '20220812163113cd91.jpg'),
(19, 19, '楓糖香蕉千層', '20220812160607fd25.jpg'),
(20, 20, '蜜蘋鐵觀音千層', '2024012601.webp'),
(21, 21, '純藍莓千層', '2024012602.webp'),
(22, 22, '綜合水果千層', '2024012603.webp'),
(23, 23, '榛果太妃糖千層', '2024012604.webp'),
(24, 24, '百香果千層', 'adm3g-9co17.jpg'),
(25, 25, '莓果乳酪千層', 'a48no-stke1.jpg'),
(26, 26, '玫瑰荔枝千層', 'aeoac-e18d4.jpg'),
(27, 27, '檸檬千層', 'ayufc-0panj.jpg'),
(28, 28, '長頸鹿可可千層', 'ac697-sn6bc.jpg'),
(29, 29, '豹紋可可千層', 'amcx0-e3mt0.jpg'),
(30, 30, '栗子蒙布朗塔', '2024012605.webp'),
(31, 31, '摩卡巧克力塔', '2024012606.webp'),
(32, 32, '酸溜溜檸檬塔', '2024012607.webp'),
(33, 33, '抹茶白巧克力塔', '2024012608.webp'),
(34, 34, '有機桑椹乳酪塔', '2024012609.webp'),
(35, 35, '香蕉巧克布朗尼塔', '2024012610.webp'),
(36, 36, '綠葡萄蜂蜜優格塔', '2024012611.webp'),
(37, 37, '鹽之花焦糖胡桃塔', '2024012612.webp'),
(38, 38, '草莓起司塔', '2024012613.webp'),
(39, 39, '草莓卡士達塔', '2024012614.webp'),
(40, 40, '梔子百香烏龍茶塔', 'bc3c2bff16427620a6fd9f7e38359576.jpg'),
(41, 41, '澎湃水果塔', 'f2c07e53ce82cea913e43fff5a28a571.jpg'),
(42, 42, '碧螺春生巧克力塔', '20240126001.jpg'),
(43, 43, '烏龍檸檬塔', '20240126002.jpg'),
(44, 44, '櫻花乳酪派', '20240126003.jpg'),
(45, 45, '北海道生起士塔', '20240126004.jpg'),
(46, 46, '紅茶藍莓塔', 'berry-1.jpg'),
(47, 47, '經典黃金貝果', 'P0128500164401_3_1134916.jpg'),
(48, 48, '花言巧語', 'P0128500164419_3_1134962.jpg'),
(49, 49, '金莎OREO', 'P0128500164405_3_1135191.jpg'),
(50, 50, '蔓越莓起司三重奏', 'P0128500164416_3_1135110.jpg'),
(51, 51, '可可藍莓重乳酪', 'P0128500164421_3_1135009.jpg'),
(52, 52, '原味奶油草莓', 'P0128500164427_3_1135016.jpg'),
(53, 53, '海派甜心', 'P0128500164417_3_1135134.jpg'),
(54, 54, '原味肉桂捲', 'W1siZiIs.jpg'),
(55, 55, '糖霜肉桂捲', '2024020201.jpg'),
(56, 56, '奶油起司肉桂捲', '2024020202.jpg'),
(57, 57, '經典原味司康', '66587697.webp'),
(58, 58, '蔓越莓司康', '66587666.webp'),
(59, 59, '蜂蜜萊姆司康', '66587616.webp'),
(60, 60, '草莓優格司康', '66587607.webp'),
(61, 61, '可可豆司康', '66587584.webp'),
(62, 62, '肉桂葡萄司康', '66587536 .webp'),
(63, 63, '太妃糖海鹽司康', '66587487.webp'),
(64, 64, 'OREO司康', '66587478.webp'),
(65, 65, '鹹起司司康', '66587467.webp'),
(66, 66, '流淚吐司', 'toast1.webp'),
(67, 67, '絕對芋仔吐司', 'toast2.webp'),
(68, 68, '爆炸菠蘿頭吐司', 'toast3.webp'),
(69, 69, '巧克力爆炸菠蘿頭吐司', 'toast4.webp'),
(70, 70, '黃金三起士爆炸頭吐司', 'toast5.webp'),
(71, 71, '柑橘吐司', 'toast6.webp'),
(72, 72, '黑糖核桃葡萄吐司', 'toast7.webp'),
(73, 73, '黑芝麻吐司', 'toast8.webp'),
(74, 74, '全麥五穀米吐司', 'toast9.webp'),
(75, 75, '抹茶純戚風蛋糕', '2021102616394976mmy1.jpg'),
(76, 76, '草莓純戚風蛋糕', '202110261643467ilkz1.jpg'),
(77, 77, '香草純戚風蛋糕', '20211026162902stm861.jpg'),
(78, 78, '莓果茶純戚風蛋糕', '20220331140404qksch2.jpg'),
(79, 79, '巧克力純戚風蛋糕', '20211105001024kiv231.jpg'),
(80, 80, '紅茶純戚風蛋糕', '20211022003507ar47p1.jpg'),
(81, 81, '紅茶鮮奶油戚風蛋糕', '20210925123101hc4f61.jpg'),
(82, 82, '巧克力鮮奶油戚風蛋糕', '20210925121543mm5o31.jpg'),
(83, 83, '香草鮮奶油戚風蛋糕', '202109251213286erhl1.jpg'),
(84, 84, '草莓鮮奶油戚風蛋糕', '202109251217552herz1.jpg'),
(85, 85, '抹茶鮮奶油戚風蛋糕', '20210925123211j71eo1.jpg'),
(86, 86, '黑森林夾餡蛋糕', '20210929200226q0pp01.jpg'),
(87, 87, 'OREO夾餡蛋糕', '20211027011017bgqyg1.jpg'),
(88, 88, '咖啡千層夾餡蛋糕', '20210929181641dhbj31.jpg'),
(89, 89, '摩卡夾餡蛋糕', '202109291815020grq41.jpg'),
(90, 90, '櫻桃夾餡蛋糕', '20211027005846v10lq1.jpg'),
(91, 91, '草莓夾餡蛋糕', '20210929181027pi7nl1.jpg'),
(92, 92, '原味乳酪蛋糕', 'cheesec1.webp'),
(93, 93, '巧克力乳酪蛋糕', 'cheesec2.webp'),
(94, 94, '抹茶乳酪蛋糕', 'cheesec3.webp'),
(95, 95, '檸檬乳酪蛋糕', 'cheesec4.webp'),
(96, 96, '蔓越莓生乳酪', 'cheesec5.webp'),
(97, 97, '藍莓生乳酪', 'cheesec6.webp'),
(98, 98, '覆盆子生乳酪', 'cheesec7.webp'),
(99, 99, '葡萄生乳酪', 'cheesec8.webp'),
(100, 100, '香橙生乳酪', 'cheesec9.webp'),
(101, 101, '百香果生乳酪', 'cheesec10.webp'),
(102, 102, '雪釀香芋乳酪蛋糕', 'cheesec11.webp'),
(103, 103, '美人柑玻尿酸乳酪蛋糕', 'cheesec12.webp'),
(104, 104, '初夏桑椹乳酪蛋糕', 'cheesec13.webp'),
(105, 105, '朱古力圓舞曲乳酪蛋糕', 'cheesec14.webp'),
(106, 106, '草莓玻尿酸生乳酪蛋糕', 'cheesec15.webp'),
(107, 107, '天使親吻輕乳酪蛋糕', 'cheesec16.webp'),
(108, 108, '雙層提拉米蘇', 'df-small-menu_2.jpg'),
(109, 109, '原味提拉米蘇', 'original-large-menu_1.jpg'),
(110, 110, '森林派對提拉米蘇', 'mixberry-small-menu_1.jpg'),
(111, 111, '濃情巧克力提拉米蘇', 'chocolate-small-menu_1.jpg'),
(112, 112, '瑪沙拉酒提拉米蘇', 'masala_s__1.jpg'),
(113, 113, '經典巴斯克', 'cheeseb1.webp'),
(114, 114, '濃巧巴斯克', 'cheeseb2.webp'),
(115, 115, '抹茶巴斯克', 'cheeseb3.webp'),
(116, 116, '重抹茶曲奇', 'cookiec1.webp'),
(117, 117, '雙倍焦糖曲奇', 'cookiec2.webp'),
(118, 118, '鐵觀音曲奇', 'cookiec3.webp'),
(119, 119, '紅茶拿鐵曲奇', 'cookiec4.webp'),
(120, 120, '焦糖奶油曲奇', 'cookiec5.webp'),
(121, 121, '重可可曲奇', 'cookiec6.webp'),
(122, 122, '芝麻蝴蝶酥', 'butterfly1.jpg'),
(123, 123, '原味蝴蝶酥', 'butterfly2.jpg'),
(124, 124, '伯爵茶蝴蝶酥', 'butterfly3.jpg'),
(125, 125, '焦糖鹽之花蝴蝶酥', 'butterfly4.jpg'),
(126, 126, '松露蝴蝶酥', 'butterfly5.jpg'),
(127, 127, '巧克力蝴蝶酥', 'butterfly6.jpg'),
(128, 128, '原味鳳梨酥 ', '9c407ee6-f80a-4bdd-9140-57b54e9e4d27.jpg'),
(129, 129, '鳳凰酥', '0663a713-0009-4dd8-9fcf-ac5faa2de04a.jpg'),
(130, 130, '蔓越莓鳳梨酥 ', 'e1335790-f494-42f9-975c-3d7093dbc59b.jpg'),
(131, 131, '胚芽核桃鳳梨酥 ', '9c403f24-c202-4cf5-a36b-0b9d427000b8.jpe'),
(132, 132, '柴燒龍眼桂圓酥', '7f3c1016-4f48-4e01-9387-50844a690207.jpg'),
(133, 133, '梅鳳酥 ', '3f65ff8e-077f-4f05-9536-5b1789457db3.jpg'),
(134, 134, '蔓蔓雙拼鳳梨酥', '0dc1b05c-cf5b-4f0d-be23-12e34dc82eb1.jpeg'),
(135, 135, '經典雙拼鳳梨酥', 'ab8e0923-7958-4492-8bed-eb0df9d4fc6f.jpg'),
(136, 136, '雙味雙拼鳳梨酥', '488e7454-359e-4fce-a326-99ba5e5a0662.jpg'),
(137, 137, '草莓酥', '667d4b1e-2290-4d96-9aa8-ea920209bdce.jpg'),
(138, 138, '哈密瓜酥', 'e4911757-7c73-4a4b-8ec2-4cc6d8a32be4.jpg'),
(139, 139, '南棗酥', '50b362c2-22ee-4f9f-b4f8-aad0e84ad97e.jpg'),
(140, 140, '小棗泥餅', 'ec3cac7d-1468-4d06-800e-a2f7fd78d511.png'),
(141, 141, '小椰香蛋黃餅 ', '87a3ce17-709e-4c89-a86b-f7c8e99b565a.png'),
(142, 142, '小蓮子蛋黃餅', '7528f130-e082-4ee9-baad-a4a20ea705c1.png'),
(143, 143, '波羅蛋黃酥', 'b5c64a84-7f29-4be1-bcd4-d6a2487d1ef3.jpg'),
(144, 144, '紅豆蛋黃酥', 'c74dd252-782a-498b-9c48-9d9dea9d5f3d.png'),
(145, 145, '棗泥蛋黃酥', '4779abd4-a0d4-46a4-8c75-eb1520e45db5.png'),
(146, 146, '鹹蛋黃酥', 'ba5436e3-df9d-4139-a6d4-1f0071429d8c.png'),
(147, 147, '綠豆蛋黃酥', '37a8881e-b32d-4a2d-9e3d-78ef55da0c60.png'),
(148, 148, '綠豆小月餅', '8c5fb60b-af15-4250-aee6-4d83d67a117f.png'),
(149, 149, '芋泥蛋黃酥', 'fa330bc1-96e4-43f8-af08-813c5cfd7729.png'),
(150, 150, '麻糬餅', '63903c3a-4815-4a79-8dc8-95732977d05a.jpg'),
(151, 151, '芒果雪花餅', 'cookieq1.jpg'),
(152, 152, '草莓雪花餅', 'cookieq2.jpg'),
(153, 153, '經典雪花餅', 'cookieq3.jpg'),
(154, 154, '抹茶雪花餅', 'cookieq4.jpg'),
(155, 155, '巧克力雪花餅', 'cookieq5.jpg'),
(156, 156, '花生雪花餅', 'cookieq6.jpg'),
(157, 157, '肉鬆雪花餅', 'cookieq7.jpg'),
(158, 158, '烏龜巧克力', '2024-02-09_158.png'),
(159, 159, '恐龍巧克力', '2024-02-10_159.jpg');

-- --------------------------------------------------------

--
-- 資料表結構 `subcategory`
--

CREATE TABLE `subcategory` (
  `subcategory_id` int(6) UNSIGNED NOT NULL,
  `category_id_fk` int(6) NOT NULL,
  `subcategory_name` varchar(30) NOT NULL,
  `subcategory_status` tinyint(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `subcategory`
--

INSERT INTO `subcategory` (`subcategory_id`, `category_id_fk`, `subcategory_name`, `subcategory_status`) VALUES
(1, 1, '貝果2', 1),
(2, 1, '肉桂捲 / 荳蔻捲', 1),
(3, 1, '司康', 1),
(4, 1, '吐司', 1),
(5, 2, '戚風蛋糕', 1),
(6, 2, '千層蛋糕', 1),
(7, 2, '乳酪蛋糕', 1),
(8, 2, '提拉米蘇', 1),
(9, 2, '巴斯克乳酪', 1),
(10, 3, '蝴蝶蘇', 1),
(11, 3, '曲奇', 1),
(12, 3, '蛋黃酥', 1),
(13, 3, '鳳梨酥', 1),
(14, 3, '雪花蘇', 1),
(15, 4, '草莓派', 1),
(16, 4, '巧克力派', 1),
(17, 4, '抹茶派', 1),
(18, 4, '檸檬塔', 1),
(19, 4, '堅果塔', 1),
(20, 5, '奶烙', 1),
(21, 5, '布丁', 1),
(22, 6, '牛軋糖', 1),
(23, 6, '泡芙', 1),
(24, 6, '茶飲', 1),
(25, 6, '果乾', 1),
(26, 6, '抹醬 / 果醬', 1),
(31, 7, '蛋糕', 1),
(32, 7, '馬卡龍', 1),
(33, 7, '達克瓦茲', 1),
(34, 7, '麵包', 1),
(35, 7, '巧克力', 1),
(36, 7, '乳酪', 1),
(37, 7, '塔派 ', 1);

-- --------------------------------------------------------

--
-- 資料表結構 `teacher`
--

CREATE TABLE `teacher` (
  `teacher_id` int(6) UNSIGNED NOT NULL,
  `teacher_img` varchar(50) DEFAULT NULL,
  `teacher_name` varchar(50) NOT NULL,
  `teacher_phone` char(50) NOT NULL,
  `teacher_email` varchar(200) NOT NULL,
  `teacher_expertise` mediumtext NOT NULL,
  `teacher_intro` mediumtext NOT NULL,
  `teacher_status` tinyint(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `teacher`
--

INSERT INTO `teacher` (`teacher_id`, `teacher_img`, `teacher_name`, `teacher_phone`, `teacher_email`, `teacher_expertise`, `teacher_intro`, `teacher_status`) VALUES
(1, '1-1.webp', '呂昇達', '0910-111222', 'luda@test.com', '洋菓子', '擅長化繁為簡的烘焙技巧 回歸食材最原始美味的配方\r\n\r\n\r\n• 統一麵粉烘焙技術顧問 \r\n• 法國藍絲可產品技術顧問 \r\n• 台灣原貿市場開發行銷顧問 \r\n• 德國白美娜商品開發顧問 \r\n• 可可聯盟巧克力烘焙技術顧問 \r\n• 開元食品商品部顧問 \r\n• 晶華酒店服務經理 \r\n• 口福堂總店長 \r\n• 高雄餐旅大學推廣教育烘焙講師 \r\n• 士邦Spar 攪拌器烘焙商品技術顧問\r\n\r\n我做烘焙已經超過二十年了，待過這麼多間飯店、食品行的中央工廠，製作上萬顆蛋糕。我知道大家最常遇到的烘焙問題、最常失敗的原因。看到配方時，不能只用過往的觀念去思考，懂得將烘焙理論融會貫通，才能用最輕鬆的方式呈現甜點最忠實的樣貌。追求好吃的極致，是我在甜點路上唯一並永恆追尋的目標。', 1),
(2, '2-1.webp', '呂昇達', '0910-111223', 'luda@test.com', '內餡製作', '擅長化繁為簡的烘焙技巧 回歸食材最原始美味的配方\n\n\n• 統一麵粉烘焙技術顧問 \n• 法國藍絲可產品技術顧問 \n• 台灣原貿市場開發行銷顧問 \n• 德國白美娜商品開發顧問 \n• 可可聯盟巧克力烘焙技術顧問 \n• 開元食品商品部顧問 \n• 晶華酒店服務經理 \n• 口福堂總店長 \n• 高雄餐旅大學推廣教育烘焙講師 \n• 士邦Spar 攪拌器烘焙商品技術顧問\n\n我做烘焙已經超過二十年了，待過這麼多間飯店、食品行的中央工廠，製作上萬顆蛋糕。我知道大家最常遇到的烘焙問題、最常失敗的原因。看到配方時，不能只用過往的觀念去思考，懂得將烘焙理論融會貫通，才能用最輕鬆的方式呈現甜點最忠實的樣貌。追求好吃的極致，是我在甜點路上唯一並永恆追尋的目標。', 1),
(3, '3-1.jpg', '威力', '0930-148224', 'willy@test.com', '法式常溫甜點', '自學甜點5年時間。\n著迷在自學過程中每個珍貴的失敗過程。\n\n多次甜點講師的教學經歷\n不定時快閃開課教學，期許自己傳遞更多關於「自學甜點」的美好！', 1),
(4, '4-1.jpeg', '韓國人金老師', '0923-109225', 'korkim@test.com', '馬卡龍', '我是韓國人金老師，我中文很厲害喔!!\n\n從事烘培工作超過10年，在台灣的學生已經超過2000人了，專攻韓式擠花、馬卡龍保證班、達克瓦茲、鏡面蛋糕、花花果凍、以及和菓子，教學經驗超豐富，商品在新光三越A4快閃熱賣。\n\n課程邀請：零經驗藝人網紅大來賓一起上課，不再只是老師專業的完美完成作品，而是經由與學生學習中的互動，了解課程的細節與魔鬼。\n\n想要來跟我上課的朋友，可以先報名線上課程，如果還是希望跟我實作，可以全額抵扣線上課程的方式來報名，完全不會浪費錢。', 1),
(5, '5-1.png', '幸子', '0972-197226', 'hsingtzu@test.com', '達克瓦茲', '一位太喜歡達克瓦茲的自學甜點師。\n\n因為熱愛甜點，逐漸從業餘邁向全職甜點師。目前有一間台中甜點工作室，不定期快閃開單。\n\n• 自學甜點並經營網路宅配甜點工作室至今已五年時間 \n• 社群媒體破３萬粉絲追蹤 \n• 新北自由式手作甜點烘焙教師（2020至2022） \n• 台北Miss J Baking Studio烘焙教師（2021至今） \n• 台北橙品手作·烘焙廚藝烘焙教師 （2022至今） \n• 台中Her x Her Studio烘焙教師（2022至今） \n• 高雄拜樹頭烘焙商店烘焙教師（2020至今）', 1),
(6, '6-1.jpg', '柯令達', '0937-146227', 'linda@test.com', '糖花技術蛋糕', '走跳過日本、巴黎的甜點冒險，如今回到台灣繼續甜點夢。我只想分享美好的事物，分享甜點分享歡樂\r\n\r\n• 台灣 GATEAUX 蛋糕技藝競賽 糖花藝術蛋糕 職業組冠軍 \r\n• 東京蛋糕展杏仁膏組技術獎\r\n\r\n日本東京製菓專門學校洋菓子系、法國藍帶畢業。 後於法國雷諾特學校學習，以第一名的身分畢業。', 1),
(7, '7-1.png', 'Alexis Bouillet', '0988-175228', 'alexis@test.com', '法式千層', 'Hello, I\'m Alexis Bouillet，我是Alexis 曾獲得2011年世界技能大賽甜點冠軍 我的第一堂線上課程，讓你在家就可以跟著我學習，烤出口感香氣十足的經典可頌、維也納甜酥麵包、橙香咕咕洛伕...等7款經典丹麥麵包，迷人的滋味絕對讓大人小孩都愛不釋手！\n\n第二堂 Bouillet兄弟 精心設計的線上課程，每個品項都是經典法式甜點，富含「創意」、「獨家配方」與我們多年的經驗與心血，集合多項烘焙技術的扎實知識，你絕對不能錯過！', 1),
(8, '8-1.png', '黃偈', '0997-136229', 'jie@test.com', '慕斯蛋糕', '喜歡分享做甜點的快樂，希望利用課程帶領大家認識臺灣、分享製作甜點的知識與經驗。\n\n• 旅法進修法式甜點一年 \n•  約十年甜點製作經驗 \n•  2015~2019 河床法式甜點主廚 \n•  出版書籍【黃偈的甜點日記：32道法式甜點與追夢隨筆】', 1),
(9, '9-1.jpg', '黃威達', '0989-118230', 'wayda@test.com', '乳酪甜點', '•  現任久久津乳酪菓子手造所營運執行長\n•  為北海道LUXE乳酪在台技術顧問、講師\n•  曾赴日本北海道學習乳酪甜點製作\n\n因為麵粉過敏關了麵包的門，卻因為乳酪開啟了另一扇窗\n邀請你加入這堂課程，和我一起探索乳酪的各種風貌', 1),
(10, '10-1.png', '黃偈', '0997-136229', 'jie@test.com', '慕斯蛋糕', '喜歡分享做甜點的快樂，希望利用課程帶領大家認識臺灣、分享製作甜點的知識與經驗。\n\n• 旅法進修法式甜點一年 \n•  約十年甜點製作經驗 \n•  2015~2019 河床法式甜點主廚 \n•  出版書籍【黃偈的甜點日記：32道法式甜點與追夢隨筆】', 1),
(11, '11-1.jpg', '陳小胖', '0923-389232', 'fwife@test.com', '肉桂捲', '「胖死我太太」的新手先生。 用IG紀錄透過美食寵愛（胖死）太太的愛情故事，\n 而太太是因為肉桂捲嫁給他，成為了他們愛情故事中的起源。', 1),
(12, '12-1.png', '王家承', '0952-256233', 'chia@test.com', '巧克力調溫', '新生代最具代表性職人 15年以上深耕巧克力領域達人\n\n他，全能派！精通巧克力、法式西點、丹麥麵包..... 他，理論教學派！ 多年主廚工作及教學經驗，在不斷積累中，形成了強大的理論教學體系，無所不能的技術解決之道。\n\n• Volute Croissant 品牌創辦人 \n• 18度C巧克力工房 巧克力甜點研發主廚 \n• 法國 MDAS 世界西點大賽 台灣國家代表隊 \n• 法國 Candia Professional 亞洲區品牌大使 \n• 2020法國萊思克盃 國王派冠軍 \n• Mano Mano patisserie 研發主廚 \n• fla fla tu tu 法圖甜點空間 品牌共同創辦人 \n• 香港、中國、澳門、新加坡等烘焙教室 甜點專任講師', 1),
(13, '13-1.webp', '武子靖', '0974-567234', 'chin@test.com', '歐式麵包', '大家好，我是武子靖，曾代表台灣參加多項世界級競賽 2022年在路易樂斯福世界盃麵包大賽奪得冠軍\n\n贏得世界盃冠軍後，我的腳步並沒有停下 而是開始思考該如何傳遞我在國外的所見所聞，分享對歐式麵包更多的想像\n\n我的麵包獲得了全世界厲害麵包師傅的認可。這股美味，希望能讓各位在家中就能品嚐，歡迎你們加入我的線上課程！', 1),
(14, '14-1.jpg', '游舒涵', '0925-983235', 'evayu@test.com', '法式塔派', 'all Yu can bake 主理人\n一位不務正業半路出家到法國藍帶學藝的甜點師！\n嗜吃如命，熱愛旅遊，生活點滴皆是創作靈感來源。\n\n• 30 歲辭職，勇敢前往法國取得巴黎藍帶甜點證書\n• Le Cordon Bleu Paris巴黎藍帶甜點證書\n• Pierre Hermé stagiaire 甜點實習\n• all YU can bake 甜點創辦\n• ELLE Taiwan 甜點專欄作家\n• 馬來西亞 Royal Baking Academy 專任講師\n• 2011 世界技能大賽甜點冠軍 Alexis Bouillet — MasterClass 系列專業 助手與翻譯\n• 億滋國際甜點研發技師\n• 橙品手作。烘焙廚藝烘焙教師', 1),
(15, '15-1.jpg', '游舒涵', '0925-983235', 'evayu@test.com', '法式塔派', 'all Yu can bake 主理人\n一位不務正業半路出家到法國藍帶學藝的甜點師！\n嗜吃如命，熱愛旅遊，生活點滴皆是創作靈感來源。\n\n• 30 歲辭職，勇敢前往法國取得巴黎藍帶甜點證書\n• Le Cordon Bleu Paris巴黎藍帶甜點證書\n• Pierre Hermé stagiaire 甜點實習\n• all YU can bake 甜點創辦\n• ELLE Taiwan 甜點專欄作家\n• 馬來西亞 Royal Baking Academy 專任講師\n• 2011 世界技能大賽甜點冠軍 Alexis Bouillet — MasterClass 系列專業 助手與翻譯\n• 億滋國際甜點研發技師\n• 橙品手作。烘焙廚藝烘焙教師', 1),
(16, '16-1.jpg', '張錫源', '0958-572237', 'aaron@test.com', '歐式麵包', '提倡「烘焙新食」文化\n實驗改良麵包的製作處理方式、結合豐富多元的食材選擇，充分發揮食材特性，融合出美味誘人的創新口味，將烘焙擴展到無侷限、無框架，是我畢生努力的方向。\n\n現任：芳璽烘焙藝廊烘焙總監\n經歷：\n• Croupe 手作 技術開發\n• 台灣國際兒童村 烘焙志工\n• Bonjour 品質管理經理\n• A Plus 烘焙主廚\n• 香港 Pots & Pans Cooking Studio 烘焙講師\n• 麥之田 烘焙講師\n• 原料商 烘焙技師\n\n獲獎紀錄\n• 2011美國乳酪麵包大賽 優勝\n• 2012加州葡萄乳酪烘焙大賽 優勝', 1),
(17, '17-1.webp', '黃威達', '0989-118230', 'wayda@test.com', '乳酪甜點', '•  現任久久津乳酪菓子手造所營運執行長\n•  為北海道LUXE乳酪在台技術顧問、講師\n•  曾赴日本北海道學習乳酪甜點製作\n\n因為麵粉過敏關了麵包的門，卻因為乳酪開啟了另一扇窗\n邀請你加入這堂課程，和我一起探索乳酪的各種風貌', 1),
(18, '18-1.jpg', '楊世均', '0988-509239', 'shihjun@test.com', '歐式麵包', '•  第38屆全國技能競賽冠軍\n•  第40屆國際技能競賽國手金牌\n•  美國小麥協會技術講師\n•  德麥技術簽約講師\n•  布雷夫烘焙負責人\n\n我將公開店內麵包的商業機密，歡迎加入我的課程，學習麵包好吃的秘密撇步！', 1),
(19, '19-1.jpg', '王詩成', '0988-509240', 'leo@test.com', '戚風蛋糕', '大家好，我是烘焙工程獅～\n我是一名擁有甜點魂的工程師，我喜歡化繁為簡，用工程師的本能去簡化烘焙的製程，讓大家在家就能輕鬆做出好吃的甜點給家人、朋友分享！', 1),
(20, '20-1.jpg', '任樂軒', '0988-509241', 'hin@test.com', '巧克力調溫', 'Chef Hin是國際知名甜點設計師，曾受邀擔任世界各國西點、酒店的西點行政總廚。\n不僅如此，更在台灣大專院校擔任客座講師，讓法式甜點製作更為親民，持續創作屬於在地的創意甜點。\n曾任職香港米其林三星侯布雄、美國舊金山米其林一星餐廳 Madera、北京及舊金山瑰麗酒店、台北文華東方西點行政總廚、上海半島酒店西點副主廚、榮獲北美 Valrhona C3 巧克力比賽銀獎。', 1),
(21, '21-1.jpg', '曹思蓓', '0988-509242', 'isabella@test.com', '純素甜點', '成為甜點主廚前，Isabella是一位視覺設計師，於2014年成立【GREEN BAKERY綠帶純植物烘焙】。\n希望藉由自創的純植物甜點，傳達符合環境永續、有益健康、友善動物的全新飲食概念。Isabella用\n她擅長的設計手法，從「心」歸零、重新組合並勇於跳脫傳統框架。 創作的甜點除了以美味為前提，更示範出如何從大自然的植物中取材，創造甜點中的色、香、味，希望引領更多人開始用幸福的食材做出幸福的甜點。', 1),
(22, '22-1.jpg', '威力', '0930-148224', 'willy@test.com', '法式常溫甜點', '自學甜點5年時間。\n著迷在自學過程中每個珍貴的失敗過程。\n\n多次甜點講師的教學經歷\n不定時快閃開課教學，期許自己傳遞更多關於「自學甜點」的美好！', 1),
(23, '23-1.jpg', '張家翰', '0988-509244', 'hank@test.com', '創意法式甜點', '教你用在地食材變出創意法式甜點！\n出生在風光明媚的新竹鄉間，Hank常笑稱自己是「泥巴中滾大的孩子」，不只熱愛土地，對在地食材更是情有獨鍾。走上烘焙之路後，他將這份對土地的感情轉而融入甜點創作之中，讓做出來的成品不僅精緻可口，更充滿濃濃的台灣人情味。', 1),
(24, '24-1.jpg', '拿拿摳', '0988-509245', 'nanaco@test.com', '鮮奶油蛋糕', '曾是個厭世上班族，偶然接觸到甜點工作，開啟了白天上班、晚上學甜點的兩頭燒生活。雖然辛苦，\n卻也發現對於甜點的熱愛，而走向全職甜點師之路。\n\n6年甜點店開業經驗，幽默風趣的教學風格，保證讓你上課不無聊。', 1);

-- --------------------------------------------------------

--
-- 資料表結構 `user`
--

CREATE TABLE `user` (
  `user_id` int(6) UNSIGNED NOT NULL,
  `user_img` varchar(300) DEFAULT NULL,
  `user_name` varchar(30) NOT NULL,
  `user_email` varchar(200) NOT NULL,
  `user_password` varchar(100) NOT NULL,
  `user_phone` varchar(20) NOT NULL,
  `user_createtime` datetime NOT NULL,
  `user_updatetime` datetime NOT NULL,
  `user_address` varchar(300) NOT NULL,
  `user_notes` varchar(300) NOT NULL,
  `user_status` tinyint(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `user`
--

INSERT INTO `user` (`user_id`, `user_img`, `user_name`, `user_email`, `user_password`, `user_phone`, `user_createtime`, `user_updatetime`, `user_address`, `user_notes`, `user_status`) VALUES
(1, 'u1.jpg', '許小婷', 'huxiaoting@gmail.com', '0910987654', '0910987654', '2024-01-27 20:47:00', '2024-02-10 16:01:47', '嘉義市西區民族路一段116號', '', 1),
(2, 'u00002.jpg', '張小翔', 'zhangxiaoxiang@yahoo.com.tw', '0923456789', '0923456789', '2024-01-27 11:25:00', '2024-01-27 11:25:00', '新北市板橋區民生路二段50號', '', 1),
(3, 'u00003.jpg', '李小蓉', 'lixiaorong@hotmail.com', '0934567890', '0934567890', '2024-01-27 12:35:00', '2024-01-27 12:35:00', '台中市西區民權路100號', '', 1),
(4, 'u00004.jpg', '陳小明', 'chenxiaoming@gmail.com', '0945678901', '0945678901', '2024-01-27 13:45:00', '2024-02-02 00:06:22', '高雄市左營區博愛二路30號', '亂丟垃圾', 0),
(5, 'u00005.jpg', '林小菁', 'linxiaojing@yahoo.com.tw', '0956789012', '0956789012', '2024-01-27 14:55:00', '2024-01-27 14:55:00', '台南市安南區安和路三段70號', '', 1),
(6, 'u00006.jpg', '吳小強', 'wuxiaoqiang@hotmail.com', '0967890123', '0967890123', '2024-01-27 16:05:00', '2024-01-27 16:05:00', '桃園市桃園區中山路80號', '', 1),
(7, 'u00007.jpg', '蔡小美', 'caixiaomei@gmail.com', '0978901234', '0978901234', '2024-01-27 17:16:00', '2024-02-02 00:05:15', '新竹市東區民生路一段50號', '沒有禮貌', 0),
(8, 'u00008.jpg', '王大勇', 'wangdayong@yahoo.com.tw', '0989012345', '0989012345', '2024-01-27 18:26:00', '2024-01-27 18:26:00', '苗栗縣苗栗市中正路120號', '', 1),
(9, 'u00009.jpg', '陳小雨', 'chenxiaoyu@hotmail.com', '0990123456', '0990123456', '2024-01-27 19:36:00', '2024-01-27 19:36:00', '彰化縣彰化市中山路二段90號', '', 1),
(10, 'u00010.jpg', '黃大志', 'huangdazhi@gmail.com', '0914445678', '0914445678', '2024-01-27 10:15:00', '2024-02-02 00:16:49', '台北市中正區忠孝東路一段100號', '很可愛', 1),
(11, 'u00011.jpg', '張琪瑤', 'zhangqiyao@gmail.com', '0912345678', '0912345678', '2024-01-27 10:15:00', '2024-01-27 10:15:00', '台北市中正區忠孝東路一段100號', '', 1),
(12, 'u12.jpg', '陳悠雅', 'chenyouya@yahoo.com.tw', '0923456789', '0923456789', '2024-01-27 11:25:00', '2024-02-02 00:07:34', '新北市板橋區民生路二段50號', '亂翻垃圾筒', 0),
(13, 'u00013.jpg', '王詩涵', 'wangshihan@hotmail.com', '0934567890', '0934567890', '2024-01-27 12:35:00', '2024-01-27 12:35:00', '台中市西區民權路100號', '', 1),
(14, 'u00014.jpg', '蔡宛芸', 'caiwanYun@gmail.com', '0945678901', '0945678901', '2024-01-27 13:45:00', '2024-01-27 13:45:00', '高雄市左營區博愛二路30號', '', 1),
(15, 'u00015.jpg', '林雅雯', 'linyawen@yahoo.com.tw', '0956789012', '0956789012', '2024-01-27 14:55:00', '2024-01-27 14:55:00', '台南市安南區安和路三段70號', '', 1),
(16, 'u00016.jpg', '吳雨婷', 'wuyuting@hotmail.com', '0967890123', '0967890123', '2024-01-27 16:05:00', '2024-01-27 16:05:00', '桃園市桃園區中山路80號', '', 1),
(17, 'u00017.jpg', '謝宛真', 'xiewanzhen@gmail.com', '0978901234', '0978901234', '2024-01-27 17:16:00', '2024-01-27 17:16:00', '新竹市東區民生路一段50號', '', 1),
(18, 'u00018.jpg', '汪詩琪', 'wangshiqi@yahoo.com.tw', '0989012345', '0989012345', '2024-01-27 18:26:00', '2024-01-27 18:26:00', '苗栗縣苗栗市中正路120號', '', 1),
(19, 'u00019.jpg', '陳宛瑜', 'chenwanyu@hotmail.com', '0990123456', '0990123456', '2024-01-27 19:36:00', '2024-01-27 19:36:00', '彰化縣彰化市中山路二段90號', '', 1),
(20, 'u00020.jpg', '黃詩婷', 'huangshiting@gmail.com', '0910987441', '0910987441', '2024-01-27 20:47:00', '2024-01-27 20:47:00', '嘉義市西區民族路一段110號', '', 1),
(21, 'u00020.jpg', '劉小妍', 'liuxiaoyan@yahoo.com.tw', '0923456001', '0923456001', '2024-01-28 09:15:00', '2024-01-28 09:15:00', '台北市大安區信義路四段200號', '', 1),
(22, 'u00022.jpg\n', '林小昕', 'linxiaoxin@hotmail.com', '0934567111', '0934567111', '2024-01-28 10:25:00', '2024-01-28 10:25:00', '新北市新莊區中正路六段80號', '', 1),
(23, 'u00023.jpg\n', '張小瑜', 'zhangxiaoyu@gmail.com', '0945678222', '0945678222', '2024-01-28 11:35:00', '2024-01-28 11:35:00', '台中市南區建國北路50號', '', 1),
(24, 'u00024.jpg\n', '許小凡', 'huxiaofan@yahoo.com.tw', '0956789333', '0956789333', '2024-01-28 12:45:00', '2024-01-28 12:45:00', '高雄市三民區民族一路30號', '', 1),
(25, 'u00025.jpg\n', '吳小潔', 'wuxiaojie@hotmail.com', '0967890444', '0967890444', '2024-01-28 13:55:00', '2024-02-02 00:14:38', '台南市北區和平路二段70號', '偷吃餅乾還裝沒事', 0),
(26, 'u00026.jpg\n', '陳小琳', 'chenxiaolin@yahoo.com.tw', '0978901555', '0978901555', '2024-01-28 15:05:00', '2024-01-28 15:05:00', '桃園市中壢區自強路80號', '', 1),
(27, 'u00027.jpg\n', '黃小娟', 'huangxiaojuan@gmail.com', '0989012666', '0989012666', '2024-01-28 16:16:00', '2024-01-28 16:16:00', '新竹市北區光復路一段50號', '', 1),
(28, 'u00028.jpg\n', '王小羽', 'wangxiaoyu@yahoo.com.tw', '0990123777', '0990123777', '2024-01-28 17:26:00', '2024-01-28 17:26:00', '苗栗縣竹南市博愛路120號', '', 1),
(29, 'u00029.jpg\n', '林小枝', 'linxiaozhi@hotmail.com', '0912345888', '0912345888', '2024-01-28 18:36:00', '2024-01-28 18:36:00', '彰化縣二林市中山路二段90號', '', 1),
(30, 'u00030.jpg\n', '陳小晶', 'chenxiaojing@gmail.com', '0912345999', '0912345999', '2024-01-28 19:46:00', '2024-01-28 19:46:00', '台北市中山區中山北路一段100號', '', 1),
(31, 'u00031.jpg\n', '張小慧', 'zhangxiaohui@gmail.com', '0923456000', '0923456000', '2024-01-28 09:15:00', '2024-01-28 09:15:00', '台北市大安區信義路四段200號', '', 1),
(32, 'u00032.jpg\n', '林小欣', 'linxiaoxin@hotmail.com', '0934567110', '0934567110', '2024-01-28 10:25:00', '2024-01-28 10:25:00', '新北市新莊區中正路六段80號', '', 1),
(33, 'u00033.jpg\n', '張小玉', 'zhangxiaoyu@gmail.com', '0945678221', '0945678221', '2024-01-28 11:35:00', '2024-01-28 11:35:00', '台中市南區建國北路50號', '', 1),
(34, 'u00034.jpg\n', '許小杰', 'huxiaojie@yahoo.com.tw', '0956789332', '0956789332', '2024-01-28 12:45:00', '2024-01-28 12:45:00', '高雄市三民區民族一路30號', '', 1),
(35, 'u00035.jpg\n', '吳小琴', 'wuxiaoqin@hotmail.com', '0967890443', '0967890443', '2024-01-28 13:55:00', '2024-01-28 13:55:00', '台南市北區和平路二段70號', '', 1),
(36, 'u00036.jpg\n', '陳小華', 'chenxiaohua@yahoo.com.tw', '0978901554', '0978901554', '2024-01-28 15:05:00', '2024-01-28 15:05:00', '桃園市中壢區自強路80號', '', 1),
(37, 'u00037.jpg\n', '黃小英', 'huangxiaoying@gmail.com', '0989012665', '0989012665', '2024-01-28 16:16:00', '2024-01-28 16:16:00', '新竹市北區光復路一段50號', '', 1),
(38, 'u00038.jpg\n', '王小蓮', 'wangxiaolian@yahoo.com.tw', '0990123776', '0990123776', '2024-01-28 17:26:00', '2024-01-28 17:26:00', '苗栗縣竹南市博愛路120號', '', 1),
(39, 'u00039.jpg\n', '林小美', 'linxiaomei@hotmail.com', '0912345887', '0912345887', '2024-01-28 18:36:00', '2024-01-28 18:36:00', '彰化縣二林市中山路二段90號', '', 1),
(40, 'u00040.jpg\n', '陳小曼', 'chenxiaoman@gmail.com', '0912345998', '0912345998', '2024-01-28 19:46:00', '2024-01-28 19:46:00', '台北市中山區中山北路一段100號', '', 1),
(41, NULL, '龍飛翔', 'longfeixiang@gmail.com', '0956789332', '0923456000', '2024-01-28 15:05:01', '2024-01-28 19:46:01', '台北市信義區忠孝東路五段100號', '', 1),
(42, 'u42.jpg', '蕭飄雪', 'xiaopiaoxue@yahoo.com.tw', '0967890443', '0934567110', '2024-01-28 16:16:01', '2024-02-02 00:08:30', '新北市新店區寶橋路三段20號', '拿拖鞋打小孩', 0),
(43, NULL, '謝無影', 'xiewuying@hotmail.com', '0978901554', '0945678221', '2024-01-28 17:26:01', '2024-01-28 19:46:03', '台中市北區三民路三段30號', '', 1),
(44, NULL, '嬌莫名', 'jiaomoming@gmail.com', '0989012665', '0956789332', '2024-01-28 18:36:01', '2024-01-28 19:46:04', '高雄市前鎮區中山二路50號', '', 1),
(45, NULL, '甄無畏', 'zhenwuwei@yahoo.com.tw', '0990123776', '0967890443', '2024-01-28 19:46:01', '2024-01-28 19:46:05', '台南市永康區永大路五段70號', '', 1),
(46, NULL, '戚冷雨', 'qilengyu@hotmail.com', '0912345887', '0978901554', '2024-01-28 09:15:01', '2024-01-28 19:46:06', '桃園市桃園區中正路80號', '', 1),
(47, NULL, '慕容風華', 'murongfenghua@gmail.com', '0912345998', '0989012665', '2024-01-28 10:25:01', '2024-01-28 19:46:07', '新竹市東區中央路二段50號', '', 1),
(48, NULL, '趙冷雲', 'zhaolengyun@yahoo.com.tw', '0956789332', '0990123776', '2024-01-28 11:35:01', '2024-01-28 19:46:08', '苗栗縣苗栗市中正路120號', '', 1),
(49, NULL, '司徒烈雨', 'situlieyu@hotmail.com', '0967890443', '0912345887', '2024-01-28 12:45:01', '2024-01-28 19:46:09', '彰化縣員林市中山路二段90號', '', 1),
(50, 'u50.png', '黃烈火', 'huangliehuo@gmail.com', '0978901554', '0912345998', '2024-01-28 13:55:01', '2024-02-02 00:09:34', '台北市中正區羅斯福路四段100號', '在店裡用噴射火焰', 0),
(51, NULL, '黎風雨', 'lifengyu@yahoo.com.tw', '0989012665', '0923456000', '2024-01-28 15:05:01', '2024-01-28 19:46:11', '新北市三峽區復興路一段10號', '', 1),
(52, NULL, '沈風起', 'shenfengqi@gmail.com', '0990123776', '0934567110', '2024-01-28 16:16:01', '2024-01-28 19:46:12', '新竹市東區中央路三段30號', '', 1),
(53, NULL, '陽武藏', 'yangwuzang@yahoo.com.tw', '0912345887', '0945678221', '2024-01-28 17:26:01', '2024-01-28 19:46:13', '台中市西區中興街50號', '', 1),
(54, NULL, '李火龍', 'lihuolong@hotmail.com', '0912345998', '0956789332', '2024-01-28 18:36:01', '2024-01-28 19:46:14', '高雄市鳳山區文化路一段70號', '', 1),
(55, NULL, '孫雷震', 'sunleizhen@gmail.com', '0956789332', '0967890443', '2024-01-28 19:46:01', '2024-01-28 19:46:15', '台南市中西區民族路二段30號', '', 1),
(56, NULL, '潘雷音', 'panleiyin@yahoo.com.tw', '0967890443', '0978901554', '2024-01-28 15:05:02', '2024-01-28 19:46:16', '新北市板橋區民權路三段70號', '', 1),
(57, NULL, '秦烈風', 'qinliefeng@hotmail.com', '0978901554', '0989012665', '2024-01-28 16:16:02', '2024-01-28 19:46:17', '台北市大安區信義路四段80號', '', 1),
(58, NULL, '張冰雪', 'zhangbingxue@gmail.com', '0989012665', '0990123776', '2024-01-28 17:26:02', '2024-02-01 23:30:10', '新北市三重區重新路五段30號', '', 1),
(59, NULL, '龍風華', 'longfenghua@yahoo.com.tw', '0990123776', '0912345887', '2024-01-28 18:36:02', '2024-01-28 19:46:19', '台中市南區南屯路二段50號', '', 1),
(60, NULL, '歐陽風雨', 'ouyangfengyu@hotmail.com', '0912345887', '0912345998', '2024-01-28 19:46:02', '2024-01-28 19:46:20', '彰化縣彰化市中山路一段100號', '', 1),
(61, NULL, '蔡小美', 'caixiaomei@yahoo.com.tw', '0923456002', '0989012666', '2024-01-28 09:15:02', '2024-01-28 19:46:21', '台北市中山區中山北路二段30號', '', 1),
(62, NULL, '陳婉婷', 'chenwanting@gmail.com', '0934567112', '0978901556', '2024-01-28 10:25:02', '2024-01-28 19:46:22', '新北市三峽區和平路三段40號', '', 1),
(63, NULL, '葉小雲', 'yexiaoyun@hotmail.com', '0945678223', '0990123778', '2024-01-28 11:35:02', '2024-01-28 19:46:23', '台中市北區平等路四段60號', '', 1),
(64, NULL, '吳小美', 'wuxiaomei@yahoo.com.tw', '0956789334', '0912345889', '2024-01-28 12:45:02', '2024-01-28 19:46:24', '高雄市前金區六合二路五號', '', 1),
(65, NULL, '林小玲', 'linxiaoling@gmail.com', '0967890445', '0923456003', '2024-01-28 13:55:02', '2024-01-28 19:46:25', '台南市南區裕誠路六段70號', '', 1),
(66, NULL, '黃小儀', 'huangxiaoyi@hotmail.com', '0978901556', '0934567113', '2024-01-28 15:05:02', '2024-01-28 19:46:26', '桃園市中壢區中正路五段80號', '', 1),
(67, NULL, '王小玉', 'wangxiaoyu@yahoo.com.tw', '0989012668', '0945678224', '2024-01-28 16:16:02', '2024-01-28 19:46:27', '新竹市東區光復路二段50號', '', 1),
(68, NULL, '張小娜', 'zhangxiaona@gmail.com', '0990123779', '0956789335', '2024-01-28 17:26:02', '2024-01-28 19:46:28', '苗栗縣竹南市中正路八段120號', '', 1),
(69, 'u69.png', '陳小寶', 'chenxiaobao@hotmail.com', '0912345890', '0912346001', '2024-01-28 18:36:02', '2024-02-02 00:12:48', '彰化縣員林市中山路三段90號', '玩電線插座', 0),
(70, NULL, '許小姍', 'huxiaoshan@yahoo.com.tw', '0912346002', '0923456004', '2024-01-28 19:46:02', '2024-01-28 19:46:30', '台北市中山區建國北路一段100號', '', 1),
(71, NULL, '林小儀', 'linxiaoyi@hotmail.com', '0923456003', '0989012669', '2024-01-28 09:15:03', '2024-01-28 19:46:31', '新北市板橋區文化路三段20號', '', 1),
(72, NULL, '張小玲', 'zhangxiaoling@gmail.com', '0934567113', '0978901557', '2024-01-28 10:25:03', '2024-01-28 19:46:32', '桃園市中壢區民族路八段30號', '', 1),
(73, NULL, '陳小芳', 'chenxiaofang@yahoo.com.tw', '0945678224', '0990123780', '2024-01-28 11:35:03', '2024-01-28 19:46:33', '台中市西屯區逢甲路六段50號', '', 1),
(74, NULL, '楊小薇', 'yangxiaowei@hotmail.com', '0956789335', '0912345891', '2024-01-28 12:45:03', '2024-01-28 19:46:34', '高雄市楠梓區德民路一段70號', '', 1),
(75, NULL, '劉小倩', 'liuxiaoqian@gmail.com', '0967890446', '0923456004', '2024-01-28 13:55:03', '2024-01-28 19:46:35', '台南市北區永華路四段90號', '', 1),
(76, NULL, '林小夢', 'linxiaomeng@yahoo.com.tw', '0978901557', '0934567114', '2024-01-28 15:05:03', '2024-01-28 19:46:36', '桃園市桃園區中正路九段80號', '', 1),
(77, NULL, '鄭小婷', 'zhengxiaoting@hotmail.com', '0989012669', '0945678225', '2024-01-28 16:16:03', '2024-01-28 19:46:37', '新北市三重區重新路六段50號', '', 1),
(78, NULL, '洪小柔', 'hongxiaorou@gmail.com', '0990123780', '0956789336', '2024-01-28 17:26:03', '2024-01-28 19:46:38', '苗栗縣苗栗市中正路一段120號', '', 1),
(79, NULL, '林小君', 'linxiaojun@yahoo.com.tw', '0912345892', '0912346002', '2024-01-28 18:36:03', '2024-01-28 19:46:39', '彰化縣彰化市中山路二段100號', '', 1),
(80, NULL, '葉小雅', 'yexiaoya@hotmail.com', '0912346003', '0923456005', '2024-01-28 19:46:03', '2024-01-28 19:46:40', '台北市中山區建國北路二段30號', '', 1);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `category`
--
ALTER TABLE `category`
  ADD PRIMARY KEY (`category_id`);

--
-- 資料表索引 `class`
--
ALTER TABLE `class`
  ADD PRIMARY KEY (`class_id`);

--
-- 資料表索引 `coupon`
--
ALTER TABLE `coupon`
  ADD PRIMARY KEY (`coupon_id`);

--
-- 資料表索引 `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`product_id`);

--
-- 資料表索引 `product_img`
--
ALTER TABLE `product_img`
  ADD PRIMARY KEY (`product_img_id`);

--
-- 資料表索引 `subcategory`
--
ALTER TABLE `subcategory`
  ADD PRIMARY KEY (`subcategory_id`);

--
-- 資料表索引 `teacher`
--
ALTER TABLE `teacher`
  ADD PRIMARY KEY (`teacher_id`);

--
-- 資料表索引 `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`user_id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `category`
--
ALTER TABLE `category`
  MODIFY `category_id` int(6) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `class`
--
ALTER TABLE `class`
  MODIFY `class_id` int(6) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `coupon`
--
ALTER TABLE `coupon`
  MODIFY `coupon_id` int(6) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=24;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product`
--
ALTER TABLE `product`
  MODIFY `product_id` int(6) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=163;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product_img`
--
ALTER TABLE `product_img`
  MODIFY `product_img_id` int(6) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=160;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `subcategory`
--
ALTER TABLE `subcategory`
  MODIFY `subcategory_id` int(6) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=38;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `teacher`
--
ALTER TABLE `teacher`
  MODIFY `teacher_id` int(6) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `user`
--
ALTER TABLE `user`
  MODIFY `user_id` int(6) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=81;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
